[
    {
        "firebaseCodigo": "010qL1UIeXAOPEgprvgK",
        "anoEdicao": "2018",
        "autor": "São Luís Grignion de Montfort",
        "descricao": "Esta devoção é um atalho para se descobrir Jesus, seja porque é uma estrela da qual não nos desviamos, seja porque nela caminhamos com maior facilidade e alegria, e consequentemente com maior velocidade. Avançamos mais um breve período de submissão e dependência a Maria do que em anos a fio de vontades próprias e confiança em nós mesmos. Um homem que seja obediente e submisso a Maria contará grandiosas vitórias sobre seus inimigos.",
        "editora": "Minha Biblioteca Católica",
        "numeroPaginas": 251,
        "paisOrigem": "Brasil",
        "titulo": "Tratado da Verdadeira Devoção à Santíssima Virgem ",
        "status": 2,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-5e362.appspot.com/o/Tratado_da_Verdadeira_Devocao_a_Santissima_Virgem_Maria.jpg?alt=media&token=348fc444-3326-4c9c-aadb-4d81ba862971",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089137,
        "dataHoraAlteracao": 1601050089137,
        "id": 1
    },
    {
        "firebaseCodigo": "07lsbkp2K0KVyCUX9qBc",
        "anoEdicao": "1927",
        "autor": "J.K Rowling",
        "descricao": "A jornada do Mundo Bruxo continua... O poderoso bruxo das trevas Geraldo Grindelwald foi capturado em Nova York com a ajuda de Newt Scamander. Grindelwald, porém, cumprindo a ameaça que fizera, foge da prisão e passa a reunir seguidores, cuja maioria não suspeita de suas verdadeiras intenções: criar bruxos puros- sangues para governar todos os seres não- mágicos. Tentando frustar os planos de Grindelwald, Alvo Dumbledore arregimenta Next, ex-presidente aluno de Hogwarts, que concorda em ajudar mais uma vez, sem saber dos perigos que o esperam. Linhas são traçadas enquanto o amor e a lealdade são testados, inclusive entre os amigos e familiares mais confiáveis, em um mundo bruxo cada vez mais divido. Animais Fantásticos:Os crimes de Grindelwald é o segundo roteiro para cinema de uma série de cinco filmes de J.K. Rowling, autora dos livros de sucesso internacional Harry Potter. Ambientado em 1927, alguns meses depois dos acontecimentos de Animais Fantásticos e onde habitam, e transferida de Nova York para Londres e Paris, e até mesmo de volta a Hogwarts, esta história de mistério e magia desvela um novo capítulo extraordinário no mundo bruxo.",
        "editora": "Rocco",
        "numeroPaginas": 287,
        "paisOrigem": "Brasil",
        "titulo": "Os crimes de Grindelwald",
        "status": 3,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/os_crimes_de_grindelwald?alt=media&token=2eed3f93-1c0b-45a4-955d-037baf3d1047",
        "subtitulo": "Animais Fantásticos",
        "categoria": "Magia",
        "dataHoraCriacao": 1601050089141,
        "dataHoraAlteracao": 1601050089141,
        "id": 2
    },
    {
        "firebaseCodigo": "0L1QSQb5dMYulv61x65k",
        "anoEdicao": "2014",
        "autor": "John Green",
        "descricao": "E naquele quase- momento entre nós dois, eu percebi que me importava com ela, pelo menos um pouco. Não sei se gostava dela, e tinha minhas dúvidas quanto a confiar nela, mas me importava o bastante para tentar descobrir. Ela na minha cama, aqueles olhos verdes enormes me ecarando. O mistério infindável do seu sorriso irônico, quase malicioso.",
        "editora": "Intrinseca",
        "numeroPaginas": 188,
        "paisOrigem": "Brasil",
        "titulo": "Quem é você Alasca?",
        "status": 2,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 0,
        "dataCompra": "2019",
        "preco": "0,00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/quem_e_voce_alasca_?alt=media&token=4a247080-765a-48fe-b716-b040ae8fdc94",
        "subtitulo": "",
        "categoria": "Romance",
        "dataHoraCriacao": 1601050089141,
        "dataHoraAlteracao": 1601050089141,
        "id": 3
    },
    {
        "firebaseCodigo": "0i8jFxG5cCaxzMYotaWm",
        "anoEdicao": "2014",
        "autor": "John Green",
        "descricao": "Na minha opiniao, Todo mundo tem seu Milagre. Por exemplo, muito provavelmente eu nunca vou ser atingido por um raio, nem ganhar um prêmio nobel nem ter um câncer terminal de ouvido. Mas se você Levar em conta todos os eventos improváveis.É Possível que pelo menos um deles Vá acontecer A casa um de nós. Eu poderia ter presenciado uma Chuva de Sapos. Poderia ter me casado com a Rainha da Inglaterra ou Sobrevivido Meses à Deriva no Mar. Mas Meu Milagre Foi o Seguinte: De todas as Casas em todos os condados da Flórida, Eu era Vizinho de Margo Roth Spiegelman.",
        "editora": "Intrinseca",
        "numeroPaginas": 251,
        "paisOrigem": "Brasil",
        "titulo": "Cidades de Papel",
        "status": 2,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 0,
        "dataCompra": "2019",
        "preco": "0,00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/cidades_de_papel?alt=media&token=13865ec7-13b7-4730-885f-eecf5fb281fa",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089141,
        "dataHoraAlteracao": 1601050089141,
        "id": 4
    },
    {
        "firebaseCodigo": "0onoKjrzk9Wh7890GltF",
        "anoEdicao": "2018",
        "autor": "Padre Marcelo Rossi",
        "descricao": "Metanoia é transformação, renovação, mudança. Quando temos problemas, angústias e inquietações, o medo tende a nos paralisar. Podemos ficar estáticos, desesperançosos, sem saber que rumo tomar. Muitas vezes, somente uma mudança, uma nova postura, é o que fará esse temor ir embora e nos deixar livres para viver com plenitude e maior felicidade. Em Metanoia, Padre Marcelo Rossi indica diversas maneiras de percorrermos essa estrada rumo à uma profunda mudança. \" Jesus é o caminho, Maria é o GPS\", indica o padre. Nestes valiosos ensinamentos, ele fala também sobre relacionamentos, provações, cura interior, a importância da autoestima, como lidar com crises e inveja e como nos tornarmos uma pessoa melhor em um caminho de Metanoia. Um caminho que supera qualquer limitação que julgamos ter ou que tenha sido imposta pela vida. \" Renovem o pensamento, abram o coração para a Palavra de Deus e Maria reconhecerá em vocês, assim como reconheceu em seu próprio Filho, pessoas que podem se transformar e promover a união entre aqueles que estão ao seu redor. Ela levará sua vontade de renovação até Jesus. A vontade de que uma Metanoia transforme a sua vida\".",
        "editora": "principium",
        "numeroPaginas": 132,
        "paisOrigem": "Brasil",
        "titulo": "Metanoia",
        "status": 2,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 0,
        "dataCompra": "2019",
        "preco": "0,00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/metanoia?alt=media&token=304ab753-fbc6-4534-b327-d908cf3adde0",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089141,
        "dataHoraAlteracao": 1601050089141,
        "id": 5
    },
    {
        "firebaseCodigo": "1LiZpG4Hpudqhlbv78lU",
        "anoEdicao": "2013",
        "autor": "Padre Marcelo Rossi",
        "descricao": "Há um momento propício na vida de cada um de nós para que a graça Divina se manifeste. Esse momento é Kairós, o tempo de Deus, um tempo que não pode ser medido, diferente do tempo dos homens. Neste livro, Padre Marcelo Rossi mostra como podemos renovar a nossa fé em Cristo e perseverar na certeza de que Deus sabe a hora certa para tudo. Com reflexões e orações inspiradoras, Kairós mantém viva a chama da esperança. Com bem define Padre Fábio de Melo no prefácio: \" este livro é filho do tempo. Nasceu da necessidade de compreender, no silêncio do coracao, que nem sempre a hora determinada por nós como certa é a hora escolhida por Deus.",
        "editora": "Globo",
        "numeroPaginas": 111,
        "paisOrigem": "Brasil",
        "titulo": "Kairós",
        "status": 2,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 0,
        "dataCompra": "2019",
        "preco": "0,00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/kairos?alt=media&token=7d740557-a5a3-4d90-970b-d5333981bc2d",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089142,
        "dataHoraAlteracao": 1601050089142,
        "id": 6
    },
    {
        "firebaseCodigo": "1tH5MmoCUIeMMrYavsAs",
        "anoEdicao": "2020",
        "autor": "Silvana Salerno",
        "descricao": "São José Operário 18 de Março",
        "editora": "Petra",
        "numeroPaginas": 59,
        "paisOrigem": "Brasil",
        "titulo": "São José",
        "status": 3,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/sao_jose?alt=media&token=07dcc3e1-dece-4dee-aea4-5ee6723fbe75",
        "subtitulo": "São José Operário",
        "categoria": "Católico",
        "dataHoraCriacao": 1601050089142,
        "dataHoraAlteracao": 1601050089142,
        "id": 7
    },
    {
        "firebaseCodigo": "2IxkrPKgsEgo9EAbViX9",
        "anoEdicao": "2010",
        "autor": "Stephenie Meyer",
        "descricao": "Bree Tanner mal se recorda da vida que tinha antes de descobrir seus sentidos extremamente aguçados, os reflexos sobre-humanos e a força física sem precedentes. A vida antes da insaciável sede de sangue... Antes de ser uma vampira.\n\nO que ela sabe é que a rotina em um bando de recém-criados é de poucas certezas, e de ainda menos regras: fique alerta, não chame atenção para si mesmo e, acima de tudo, volte para casa antes do nascer do sol, ou será destruído. O que ela não sabe: seu tempo como imortal está se esgotando. Depressa!\n\nCombinando romance, horror, ação e mistério, a trama de Stephenie Meyer mergulha na trajetória de devastação do bando de recém-criados enquanto eles se preparam para o confronto definitivo.",
        "editora": "Intrinseca",
        "numeroPaginas": 192,
        "paisOrigem": "Brasil",
        "titulo": " A Breve Segunda Vida de Bree Tanner",
        "status": 2,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 0,
        "dataCompra": "2019",
        "preco": "0,00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/_a_breve_segunda_vida_de_bree_tanner?alt=media&token=30505435-7f50-4a02-9587-2e52df755430",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089142,
        "dataHoraAlteracao": 1601050089142,
        "id": 9
    },
    {
        "firebaseCodigo": "3OFrq3UqzYi2vlm9IT6n",
        "anoEdicao": "2014",
        "autor": "Nicholas Sparks",
        "descricao": "Na primavera de 1984, os estudantes Amanda Collier e Dawson Cole se apaixonaram perdidamente. Embora vivessem em mundos muito diferentes, o amor que sentiam um pelo outro parecia forte o bastante para desafiar todas as convenções de Oriental, a pequena cidade em que moravam.Nascido em uma família de criminosos, o solitário Dawson acreditava que seu sentimento por Amanda lhe daria a força necessária para fugir do destino sombrio que parecia traçado para ele. Ela, uma garota bonita e de família tradicional, que sonhava entrar para uma universidade de renome, via no namorado um porto seguro para toda a sua paixão e seu espírito livre. Infelizmente, quando o verão do último ano de escola chegou ao fim, a realidade os separou de maneira cruel e implacável.Vinte e cinco anos depois, eles estão de volta a Oriental para o velório de Tuck Hostetler, o homem que um dia abrigou Dawson, acobertou o namoro do casal e acabou se tornando o melhor amigo dos dois.Seguindo as instruções de cartas deixadas por Tuck, o casal redescobrirá sentimentos sufocados há décadas. Após tanto tempo afastados, Amanda e Dawson irão perceber que não tiveram a vida que esperavam e que nunca conseguiram esquecer o primeiro amor. Um único fim de semana juntos e talvez seus destinos mudem para sempre.Num romance envolvente, Nicholas Sparks mostra toda a sua habilidade de contador de histórias e reafirma que o amor é a força mais poderosa do Universo - e que, quando duas pessoas se amam, nem a distância nem o tempo podem separá-las.",
        "editora": "Arqueiro",
        "numeroPaginas": 272,
        "paisOrigem": "Brasil",
        "titulo": "O Melhor de Mim",
        "status": 2,
        "isbn10": "8580413346",
        "isbn13": "9788580413342",
        "numeroEdicao": 813,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/o_melhor_de_mim?alt=media&token=45b4fd6d-cbd8-40b0-a3a9-8f4cbe304649",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089143,
        "dataHoraAlteracao": 1601050089143,
        "id": 10
    },
    {
        "firebaseCodigo": "5xGEGYnIE2ZU7P7ZuoUH",
        "anoEdicao": "2007",
        "autor": "Stephenie Meyer",
        "descricao": "Bella? A voz suave de Edward surgiu atrás de mim. Eu me virei e o vi disparando com leveza pela escada da varanda, o cabelo esvoaçado. Ele me tomou nos braços num só movimento, como tinha feito no estacionamento, e me beijou de novo. Esse beijo me assustou. Havia tensão demais, foi muito brusca a pressão de seus lábios nos meus — como se ele estivesse com medo de termos pouco tempo para nós dois.\" Enquanto Seattle é assolada por uma sequência de assassinatos misteriosos e uma vampira maligna continua em sua busca por vingança, Bella está cercada de perigos outra vez. Em meio a isso, ela é forçada a escolher entre seu amor por Edward e sua amizade com Jacob — sabendo que essa decisão tem o potencial para reacender o conflito perene entre vampiros e lobisomens. Com a proximidade da formatura, Bella tem mais uma decisão a tornar: vida ou morte. Mas o que representará cada uma dessas escolhas? Os leitores fascinados por Crepúsculo e Lua nova vão devorar ansiosamente Eclipse — o terceiro livro da excitante saga de amor e vampiros assinada por Stephenie Meyer.",
        "editora": "Intrinseca",
        "numeroPaginas": 446,
        "paisOrigem": "Brasil",
        "titulo": "Eclipse",
        "status": 2,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 0,
        "dataCompra": "2019",
        "preco": "0,00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/eclipse?alt=media&token=cd051ae7-9387-4778-9379-f42976c4c1c6",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089143,
        "dataHoraAlteracao": 1601050089143,
        "id": 11
    },
    {
        "firebaseCodigo": "6ZGFGMcRHrbaTxYUrGUM",
        "anoEdicao": "2008",
        "autor": "William P. Young",
        "descricao": "Durante uma viagem de fim de semana, a filha mais nova de Mack Allen Phillips é raptada e evidências de que ela foi brutalmente assassinada são encontradas uma velha cabana. Após quatro anos vivendo numa tristeza profunda causada pela culpa e pela saudade da menina, Mack recebe um estranho bilhete, aparentemente escrito por Deus, convidando-o a voltar à cabana onde aconteceu a tragédia. Apesar de desconfiado, ele vai ao local numa tarde de inverno e adentra passo a passo o cenário de seu mais terrível pesadelo. Mas o que ele encontra lá muda o seu destino para sempre. Em um mundo cruel e injusto, A cabana levanta um questionamento atemporal: se Deus é tão poderoso, por que não faz nada para amenizar o nosso sofrimento? As regras que Mack encontra vão surpreender você e podem transformar sua vida de maneira tão profunda como aconteceu com ele. Você vai querer partilhar este livro com todas as pessoas que ama.",
        "editora": "Arqueiro",
        "numeroPaginas": 173,
        "paisOrigem": "Brasil",
        "titulo": "A Cabana ",
        "status": 2,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 0,
        "dataCompra": "2019",
        "preco": "0,00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/a_cabana_?alt=media&token=ab3f9e7e-0f5b-4679-a52a-4fdbe7e28031",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089143,
        "dataHoraAlteracao": 1601050089143,
        "id": 12
    },
    {
        "firebaseCodigo": "7ocpNlzX4AIlQ2DusY0R",
        "anoEdicao": "2016",
        "autor": "Raquel Fernandes",
        "descricao": "O amor de Maria Santíssima deve conduzir- vos a imitá- la como exemplo de vida. Que este amor se reflita na vossa vida.",
        "editora": "Loyola",
        "numeroPaginas": 52,
        "paisOrigem": "Brasil",
        "titulo": "Devocionário E Novena A Nossa Senhora Mãe Rainha. Três Vezes Admirável",
        "status": 3,
        "isbn10": "8515026341",
        "isbn13": "9788515026340",
        "numeroEdicao": 52,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/devocionario_e_novena_a_nossa_senhora_mae_rainha_tres_vezes_admiravel?alt=media&token=b50253b4-27fa-4d64-be70-7280929d3a74",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089144,
        "dataHoraAlteracao": 1601050089144,
        "id": 13
    },
    {
        "firebaseCodigo": "89ig9ghudxi1Ct10IKIe",
        "anoEdicao": "2016",
        "autor": "JoJo Moyes",
        "descricao": "Lou Clark sabe uma porção de coisas. Ela sabe quantos passos separam sua casa do ponto de ônibus. Sabe que adora trabalhar como atendente em um café e sabe que provavelmente não ama seu namorado, Patrick. O que Lou não sabe é que está prestes a perder o emprego, e que isso a obrigará a repensar toda sua vida. Will Traynor, por sua vez, sabe que o acidente com a motocicleta tirou dele a vontade de viver. Ele sabe que o mundo agora parece pequeno e sem graça, e sabe experimentar como vai dar um fim a tudo isso. O que Will não sabe é que a chegada de Lou vai trazer de volta a cor à sua vida. E nenhum deles desconfia de que esse encontro irá mudar para sempre a história dos dois.",
        "editora": "Intrinseca",
        "numeroPaginas": 286,
        "paisOrigem": "Brasil",
        "titulo": "Como eu era antes de você",
        "status": 2,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 0,
        "dataCompra": "2019",
        "preco": "0,00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/como_eu_era_antes_de_voce?alt=media&token=9cc14359-5c72-4430-93e6-1d49770b2b70",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089144,
        "dataHoraAlteracao": 1601050089144,
        "id": 14
    },
    {
        "firebaseCodigo": "8GeyD6f2aKWsnenJCbQZ",
        "anoEdicao": "2013",
        "autor": "Markus Zusak",
        "descricao": "A trajetória de Liesel Meminger é contada por uma narradora mórbida, porém surpreendentemente simpática. Ao perceber que a pequena ladra de livros lhe escapa, a Morte afeiçoa-se à menina e rastreia suas pegadas de 1939 a 1943. Traços de uma sobrevivente: a mãe comunista, perseguida pelo nazismo, envia Liesel e o irmão para o subúrbio pobre de uma cidade alemã, onde um casal se dispõe a adotá-los em troca de dinheiro. O garoto morre no trajeto e é enterrado por um coveiro que deixa cair um livro na neve. É o primeiro de uma série que a menina vai surrupiar ao longo dos anos. Essa obra, que ela ainda não sabe ler, é seu único vínculo com a família. \n\nAssombrada por pesadelos, ela compensa o medo e a solidão das noites com a cumplicidade do pai adotivo, um pintor de parede bonachão que a ensina a ler. Em tempos de livros incendiados, o gosto de roubá-los deu à menina uma alcunha e uma ocupação; a sede de conhecimento deu-lhe um propósito. A vida na rua Himmel é a pseudorrealidade criada em torno do culto a Hitler na Segunda Guerra. Ela assiste à eufórica celebração do aniversário do Führer pela vizinhança. Teme a dona da loja da esquina, colaboradora do Terceiro Reich. Faz amizade com um garoto obrigado a integrar a Juventude Hitlerista. E ajuda o pai a esconder no porão um jovem judeu que escreve livros artesanais para contar a sua parte naquela história. A Morte, perplexa diante da violência humana, dá um tom leve e divertido à narrativa desse duro confronto entre a infância perdida e a crueldade do mundo adulto, um sucesso absoluto, e raro, de crítica e público.\n\n¿ A menina que roubava livros já vendeu mais de 2,5 milhões de exemplares no Brasil e por mais de dois anos figurou nas principais listas de mais vendidos. \n\n¿ A adaptação cinematográfica é dirigida por Brian Percival (Downton Abbey) e conta com Geoffrey Rush (O Discurso do Rei) e Emily Watson (Ondas do Destino) no papel dos pais adotivos de Liesel. Diante da expectativa do público, a Fox Film do Brasil decidiu adiantar a estreia do longa para 17 de janeiro.",
        "editora": "Intrínseca",
        "numeroPaginas": 480,
        "paisOrigem": "Brasil",
        "titulo": "A Menina Que Roubava Livros",
        "status": 2,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 0,
        "dataCompra": "2019",
        "preco": "0,00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/a_menina_que_roubava_livros?alt=media&token=b8eaf98f-0838-47f6-9a7d-4e3250f1067a",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089145,
        "dataHoraAlteracao": 1601050089145,
        "id": 15
    },
    {
        "firebaseCodigo": "8RhVooHwzBWOQhjpsTQr",
        "anoEdicao": "2017",
        "autor": "Pedro Siqueira",
        "descricao": "Durante A Segunda Guerra Mundial, uma esquadrilha da Força Aérea dos Estados Unidos não consegue completar uma missão na Itália devido a um fenômeno inexplicável. Quando sobrevoam o monte Gargano, os militares têm uma visão sobrenatural que os aterroriza e os faz voltar para a base. O que poderia ser apenas um ataque militar frustrado acaba se tornando o ponto de partida para a conversão de dois oficiais. Curiosos para desvendar o misterioso evento, Connors e Bloom vão até um convento na cidade de San Giovanni Rotondo, onde pode estar a resposta para as suas dúvidas. Muitos anos depois, no leito do hospital, Connors sente que ainda precisa completar a missão de dar um rumo à vida do filho, Rafael, e lhe entrega um envelope, pedindo que o abra após sua morte. Quando é chegada a hora, o rapaz se depara com um bilhete contendo o último pedido de Connors: ele deve partir para uma cidade desconhecida à procura do que o pai chama de \"verdadeiro caminho\". Essa viagem permitirá que o jovem relembre todas as fabulosas histórias do pai e inicie uma jornada de autoconhecimento, abalando seus conceitos sobre a vida, a fé e o amor. No segundo livro da trilogia iniciada com Senhora das águas, Pedro Siquera constrói mais uma história tocante sobre a busca pela espiritualidade, retomando sua forte conexão com Nossa Senhora.",
        "editora": "Sextante",
        "numeroPaginas": 254,
        "paisOrigem": "Brasil",
        "titulo": "Senhora dos ares",
        "status": 3,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/senhora_dos_ares?alt=media&token=02e5387a-e20a-46fd-a3f3-195c59038776",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089145,
        "dataHoraAlteracao": 1601050089145,
        "id": 16
    },
    {
        "firebaseCodigo": "8xzyTLAw7qOxPZZTsMa1",
        "anoEdicao": "2016",
        "autor": "William Paul Young",
        "descricao": "Um derrame cerebral deixa Anthony Spencer, um multimilionário egocêntrico, em coma. Quando \"acorda\", ele se vê em um mundo surreal habitado por um estranho, que descobre ser Jesus, e por uma idosa que é o Espírito Santo. \n\nÀ sua frente se descortina uma paisagem que lhe revela toda a mágoa e a tristeza de sua vida terrena. Jamais poderia ter imaginado tamanho horror. Debatendo-se contra um sofrimento emocional insuportável, ele implora por uma segunda chance. \n\nSua prece é ouvida e ele é enviado de volta à Terra, onde viverá uma experiência de profunda comunhão com uma série de pessoas e terá a oportunidade de reexaminar a própria vida. Nessa jornada, precisará \"enxergar\" através dos olhos dos outros e conhecer suas visões de mundo, suas esperanças, seus medos e seus desafios. \n\nNa busca por redenção, Tony deverá usar um poder que lhe foi concedido: o de curar uma pessoa. Será que ele terá coragem de fazer a escolha certa? ",
        "editora": "Editora Arqueiro",
        "numeroPaginas": 240,
        "paisOrigem": "Brasil",
        "titulo": "A travessia",
        "status": 2,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 0,
        "dataCompra": "2019",
        "preco": "0,00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/a_travessia?alt=media&token=7ccd7c49-1e4f-4e43-a405-76199e6a98e7",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089145,
        "dataHoraAlteracao": 1601050089145,
        "id": 17
    },
    {
        "firebaseCodigo": "9Eop7zlCuIOvnnrRA8iX",
        "anoEdicao": "2015",
        "autor": "Stephanie",
        "descricao": "Quando Beaufort Swan se muda para a melancólica cidade de Forks e conhece a misteriosa e atraente Edythe Cullen, sua vida dá uma guinada emocionante e apavorante. Com a pele de porcelana, os olhos dourados, uma voz hipnótica e dons sobrenaturais, Edythe é ao mesmo tempo enigmática e irresistível. O que Beau Não Percebe é Que, quanto mais se aproxima dela, maior o perigo para ele e para os que o cercam. E pode ser tarde demais para voltar atrás...Em Comemoração ao Aniversário de 10 anos da publicação de Crepúsculo nos Estados Unidos, Stephenie Meyer fez Vida e Morte, uma corajosa releitura da icônica história de amor que vai surpreender e encantar os leitores. Esta edição especial dupla inclui ainda um prefácio da autora e o romance original na íntegra. Vire o livro e leia Crepúsculo.",
        "editora": "intrínseca",
        "numeroPaginas": 391,
        "paisOrigem": "Brasil",
        "titulo": "Vida e morte Crepúsculo Reimaginado",
        "status": 3,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/vida_e_morte_crepusculo_reimaginado?alt=media&token=dd9e6b5f-a413-4704-b4a9-a942ac4084d4",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089145,
        "dataHoraAlteracao": 1601050089145,
        "id": 18
    },
    {
        "firebaseCodigo": "9WIB6zqiDC59C9fV11z2",
        "anoEdicao": "2017",
        "autor": "Lewis Carroll",
        "descricao": "Depois de cair na toca do Coelho Branco e de viver aventuras mágicas no País das Maravilhas, Alice, curiosa como sempre, resolve investigar o que existe atrás do espelho que fica acima da lareira de sua casa. Não se sabe de que jeito ela consegue passar através do espelho e sair num mundo completamente diferente, meio maluco, até, com um terreno marcado como um tabuleiro de xadrez. Ali, encontra figuras excêntricas e surpreendentes como o Rei e a Rainha brancos e o Rei e a Rainha vermelhos do jogo de xadrez, o Coelho Branco, Tweedledum e Tweedledee, Humpty Dumpty, flores que falam, bichos e muitos outros seres fantásticos. E é com eles que Alice vive situações engraçadas ou estranhas, ou perigosas, ou absurdas. Tudo isso comandado pelas regras do jogo de xadrez, que a menina deve seguir para chegar ao seu destino e realizar seu sonho.",
        "editora": "Autêntica",
        "numeroPaginas": 143,
        "paisOrigem": "Brasil",
        "titulo": "Alice Através do Espelho",
        "status": 2,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 0,
        "dataCompra": "2019",
        "preco": "0,00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/alice_atraves_do_espelho?alt=media&token=04395792-cab7-4c87-8279-e62f249050bc",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089146,
        "dataHoraAlteracao": 1601050089146,
        "id": 19
    },
    {
        "firebaseCodigo": "A0dbxAXv4izZsSwgf8OQ",
        "anoEdicao": "2019",
        "autor": "Nicholas Sparks",
        "descricao": "Os livros de Nicholas Sparks foram traduzidos para mais de 50 idiomas e já ultrapassaram os 100 milhões de exemplares no mundo todo, sendo 3 milhões só no Brasil.Um amor para recordar foi adaptado para o cinema em 2002, com Shane West e Mandy Moore como protagonistas.“De vez em quando nos deparamos com um livro extraordinário que nos deixa maravilhados com o tesouro escondido ali. Um amor para recordar é um desses livros. Uma história comovente e fascinante que você não esquecerá tão cedo.” – New York PostAos 17 anos, a vida de Landon Carter muda para sempre. Largado pela namorada e sem companhia para o baile da escola, ele está desesperado para dar a volta por cima. Como as garotas que lhe interessam já têm par, sua única opção é alguém impensável: Jamie Sullivan, a filha do pastor da igreja que frequenta. Para Landon e seus amigos, Jamie é muito esquisita.",
        "editora": "Arqueiro",
        "numeroPaginas": 140,
        "paisOrigem": "Brasil",
        "titulo": "Um amor para recordar",
        "status": 2,
        "isbn10": "8580419816",
        "isbn13": "9788580419818",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/um_amor_para_recordar?alt=media&token=a97b5769-3454-4961-806f-20ea25418516",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089146,
        "dataHoraAlteracao": 1601050089146,
        "id": 20
    },
    {
        "firebaseCodigo": "BGzh8Rm0l6QS1f1kKMtv",
        "anoEdicao": "2008",
        "autor": "Stephenie Meyer",
        "descricao": "\"Nunca pensei muito em como morreria - embora nos últimos meses tivesse motivos suficientes para isso -, mas, mesmo que tivesse pensado, não teria imaginado que seria assim. (...) Sem dúvida era uma boa forma de morrer, no lugar de outra pessoa, de alguém que eu amava. Nobre, até. Isso devia contar para alguma coisa.\"\n\nIsabella Swan chega à nublada e chuvosa cidadezinha de Forks - último lugar onde gostaria de viver. Tenta se adaptar à vida provinciana na qual aparentemente todos se conhecem, lidar com sua constrangedora falta de coordenação motora e se habituar a morar com um pai com quem nunca conviveu. Em seu destino está Edward Cullen.\nEle é lindo, perfeito, misterioso e, à primeira vista, hostil à presença de Bella - o que provoca nela uma inquietação desconcertante. Ela se apaixona. Ele, no melhor estilo \"amor proibido\", alerta: Sou um risco para você. Ela é uma garota incomum. Ele é um vampiro. Ela precisa aprender a controlar seu corpo quando ele a toca. Ele, a controlar sua sede pelo sangue dela.\nO que Bella não percebe é que quanto mais se aproxima dele, maior é o perigo para si e para os que a cercam. E pode ser tarde demais para voltar atrás... Combinando sensualidade e mistério, romance e fantasia, Stephenie Meyer produz uma trama de extraordinário suspense neste primeiro volume da série que marcou sua estréia literária. Tremendamente sedutor, Crepúsculo mantém seus leitores ligados até a última página.",
        "editora": "Intrinseca",
        "numeroPaginas": 416,
        "paisOrigem": "Brasil",
        "titulo": "Crepúsculo",
        "status": 2,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 0,
        "dataCompra": "2019",
        "preco": "0,00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/crepusculo?alt=media&token=2bfc7464-d918-462f-8d2b-3ec8f414af6d",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089146,
        "dataHoraAlteracao": 1601050089146,
        "id": 22
    },
    {
        "firebaseCodigo": "BclNRUujerDy59z53AwL",
        "anoEdicao": "2018",
        "autor": "Nicholas Sparks",
        "descricao": "Relata sobre a confiança no amor verdadeiro\".",
        "editora": "Arqueiro",
        "numeroPaginas": 301,
        "paisOrigem": "Brasil",
        "titulo": "Um Homem de Sorte ",
        "status": 3,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/um_homem_de_sorte_?alt=media&token=81738764-850b-45a8-8d0e-d49d9d46392c",
        "subtitulo": "",
        "categoria": "Romance",
        "dataHoraCriacao": 1601050089147,
        "dataHoraAlteracao": 1601050089147,
        "id": 111
    },
    {
        "firebaseCodigo": "CYgm3HvZGqabf0d3nIe3",
        "anoEdicao": "2016",
        "autor": "Nicholas Sparks",
        "descricao": "A Escolha Levanta Uma das Questões Mais Difíceis Da Vida: ATÉ ONDE VOCÊ IRIA EM NOME DE UM AMOR VERDADEIRO? ",
        "editora": "Arqueiro",
        "numeroPaginas": 232,
        "paisOrigem": "Brasil",
        "titulo": "A Escolha ",
        "status": 3,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/a_escolha_?alt=media&token=8135ba95-17ce-4e6e-8916-01cb3d94499c",
        "subtitulo": "Deixe seu Coração Decidir",
        "categoria": "Romance",
        "dataHoraCriacao": 1601050089147,
        "dataHoraAlteracao": 1601050089147,
        "id": 110
    },
    {
        "firebaseCodigo": "DCfEDjRMxVuBpJjLyMpb",
        "anoEdicao": "2015",
        "autor": "J.K Rowling",
        "descricao": "Desta vez, Harry Potter foi encarregado de uma tarefa obscura, perigosa e aparentemente impossível: localizar e destruir os Horcruxes remanescentes de Voldemort. Potter nunca esteve tão sozinho nem teve de enfrentar um futuro tão sombrio. Porém, de algum modo, Harry deve encontrar dentro de si próprio a força para completar a tarefa que lhe foi dada: ele deve sair do ambiente acolhedor e seguro da Toca para seguir sem temor nem hesitação pelo inexorável caminho que lhe foi traçado...<br />Na sétima e última parte da saga de Harry Potter, J.K. Rowling revela de modo espetacular respostas que há muito são esperadas. A encantadora e elaborada narrativa, com guinadas repentinas em compassos de tirar o fôlego, confirma a autora como uma grande contadora de histórias cujos livros serão lidos, re-lidos e lidos mais uma vez.",
        "editora": "Rocco",
        "numeroPaginas": 552,
        "paisOrigem": "Brasil",
        "titulo": "Harry Potter e as Relíquias da Morte (Harry Potter, #7)",
        "status": 3,
        "isbn10": "853253001X",
        "isbn13": "9788532530011",
        "numeroEdicao": 55,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/harry_potter_e_as_reliquias_da_morte__harry_potter__%237_?alt=media&token=f2b0cf3f-69a2-4a1c-ab9c-e54d71b83f84",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089147,
        "dataHoraAlteracao": 1601050089147,
        "id": 23
    },
    {
        "firebaseCodigo": "DR0ez97GCcvpssmXBqOQ",
        "anoEdicao": "2019",
        "autor": "Santa Gemma Galgani",
        "descricao": "\"Certo dia, fui tomada por tanta dor ao admirar o Crucificado, que caí por terra desfalecida; por acaso o papai estava em casa, e começou a me dar bronca, dizendo que me fazia mal estar sempre dentro de casa e sair de manhã cedinho (já fazia dois dias que não me deixava ir à Missa pela manhã). Respondi, brava: – Me faz mal é estar longe de Jesus Sacramentado. Ele Ficou tão bravo com a resposta, que me deu um forte grito; escondi-me no quarto, e foi a primeira vez que expressei abertamente a minha dor somente a Jesus: Quero seguir-te a custo de qualquer dor, e te seguirei fervorosamente. Não, Jesus, não te darei mais mal-estar por agir de maneira morna, como fiz até então: seria vir a teu encontro para dar-te desgosto. Então proponho: oração com mais devoção, comunhões mais frequentes. Jesus, quero sofrer, e sofrer muito, por ti. As orações sempre em meus lábios. Se quem se propõe a fazer muito já desiste de muito, que acontecerá com quem se propõe a pouco?\"",
        "editora": "PAULUS",
        "numeroPaginas": 90,
        "paisOrigem": "Brasil",
        "titulo": "Santa Gemma Galgani- O Caderno dos meus pecados",
        "status": 2,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/santa_gemma_galgani__o_caderno_dos_meus_pecados?alt=media&token=adedfcb0-552c-4e0a-b106-a8e82d73488f",
        "subtitulo": "Autobiografia ",
        "categoria": "Católico",
        "dataHoraCriacao": 1601050089147,
        "dataHoraAlteracao": 1601050089147,
        "id": 113
    },
    {
        "firebaseCodigo": "EJYTQVYrquSpQYyYzmuY",
        "anoEdicao": "2017",
        "autor": "R.J.Palacio",
        "descricao": "O ponto de vista de uma criança que, ciente de sua estranheza e de seu deslocamento no mundo, cria um manifesto em favor da gentileza.\" Não julgue um menino pela cara.",
        "editora": "intrínseca",
        "numeroPaginas": 207,
        "paisOrigem": "Brasil",
        "titulo": "Extraordinário",
        "status": 2,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 0,
        "dataCompra": "2019",
        "preco": "0,00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/extraordinario?alt=media&token=fdf01f32-b948-4d12-94e1-d35f3385733e",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089148,
        "dataHoraAlteracao": 1601050089148,
        "id": 25
    },
    {
        "firebaseCodigo": "F8uHsQbZe2ASKGWY6ppl",
        "anoEdicao": "2016",
        "autor": "Pe. Léo, SCJ",
        "descricao": "Encontrar uma meta e manter o passo firme em direção às coisas que estão no Alto é próprio daqueles que sabem superar os desafios e que não se deixam abater diante das dificuldades. Para aqueles que não querem parar nem desanimar diante dos problemas, eis o ensinamento de Pe. Léo: é preciso continuar!. Em Buscai as coisas do Alto, o autor nos mostra a importância de encontrar o sentido para a nossa existência e de prosseguir no caminho, mesmo em meio à dor. É no Alto que está a nossa meta e é por ela que devemos lutar.....\" É preciso ter uma meta, e a nossa meta é muito grande. Quem se acostuma com coisa pequena não pode ir para o céu. O céu é para quem sonha grande, pensa grande, ama grande, e tem a coragem de viver pequeno. Isso é o céu.",
        "editora": "Canção Nova",
        "numeroPaginas": 159,
        "paisOrigem": "Brasil",
        "titulo": "Buscai As Coisas Do Alto",
        "status": 3,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 0,
        "dataCompra": "2019",
        "preco": "0,00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/buscai_as_coisas_do_alto?alt=media&token=7e76e8b6-7f1f-490f-8b03-82e1ee6383b0",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089148,
        "dataHoraAlteracao": 1601050089148,
        "id": 26
    },
    {
        "firebaseCodigo": "FU1T4kSiG3Kf4MCJeatl",
        "anoEdicao": "2016",
        "autor": "Nicholas Sparks",
        "descricao": "Aos 25 anos, a doce Julie Barenson perdeu seu grande amor para uma doença impiedosa. Porém, ao partir, o marido lhe deixou dois presentes inesperados: um filhote de cão dinamarquês chamado Singer e a promessa de que cuidaria dela para sempre, onde quer que estivesse.Quatro anos depois, Julie enfim está pronta para tentar amar de novo e se vê dividida entre Richard Franklin, um belo e sofisticado engenheiro que a trata como uma rainha, e Mike Harris, um mecânico gentil que – junto com Singer – tem sido seu melhor amigo desde que ficou sozinha.Ela tem que tomar uma decisão. Só não pode imaginar que, em vez de lhe trazer felicidade, essa escolha transformará sua vida num pesadelo causado por um ciúme tão doentio que está a um passo de se tornar criminoso.\"O fãs de Sparks clamam pelas histórias de amor que são sua marca registrada e, com o adicional do suspense, este será outro best-seller.\" – Publishers Weekly\"O sempre popular Nicholas Sparks, notório por seus livros românticos, combina uma história de amor envolvente com a angústia de um thriller imprevisível. A narrativa engenhosa de amor e suspense evolui com firmeza até chegar a um final tenso pelo qual vale a pena esperar.\" – Booklist",
        "editora": "Editora Arqueiro",
        "numeroPaginas": 352,
        "paisOrigem": "Brasil",
        "titulo": "O guardião",
        "status": 2,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/o_guardiao?alt=media&token=7ceb994f-508b-4f77-a2f2-9e6b2ea51ce6",
        "subtitulo": "",
        "categoria": "Ficção",
        "dataHoraCriacao": 1601050089148,
        "dataHoraAlteracao": 1601050089148,
        "id": 27
    },
    {
        "firebaseCodigo": "HWJbH35yLxcVXREUxFGV",
        "anoEdicao": "2017",
        "autor": "Nicholas Sparks",
        "descricao": "Comemorando dez anos de seu lançamento internacional, Querido John continua sendo um dos romances mais bem-sucedidos e amados de Nicholas Sparks, um especialista em tocar o coração dos leitores.Após uma juventude de rebeldia e bebedeira, John Tyree decidiu dar início a um novo capítulo em sua vida e se alistou no Exército. Um ano depois, agora um novo homem, ele retorna a Wilmington, na Carolina do Norte, para passar um tempo com o velho pai.Uma tarde, enquanto admira o pôr do sol da pequena cidade litorânea, ele conhece a garota de seus sonhos. Além de ser linda, Savannah é amigável, de sorriso fácil, um exemplo de boa conduta e altruísmo. Curiosamente, esse contraste de personalidades não impede que um sentimento arrebatador nasça entre os dois.No entanto, John precisa voltar para a Alemanha a fim de concluir o serviço militar. Em nome do amor, Savannah decide esperar por ele, enquanto o jovem soldado promete que, após esse período, vai ficar para sempre ao lado da mulher que conquistou seu coração.O que nenhum dos dois poderia esperar eram os eventos do 11 de Setembro. Enquanto John entra em combate no Iraque, Savannah precisa reunir forças para superar a dor da distância. Nesse cenário de saudade e incertezas, uma simples carta pode mudar a vida dos dois para sempre.",
        "editora": "Arqueiro",
        "numeroPaginas": 288,
        "paisOrigem": "Brasil",
        "titulo": "Querido John",
        "status": 2,
        "isbn10": "8580417716",
        "isbn13": "9788580417715",
        "numeroEdicao": 2,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/querido_john?alt=media&token=e9f4c34c-033c-44ec-8aca-b952fef3592c",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089149,
        "dataHoraAlteracao": 1601050089149,
        "id": 28
    },
    {
        "firebaseCodigo": "IOGoDqrjz7WjinMASMeN",
        "anoEdicao": "2019",
        "autor": "Sherlock Holmes",
        "descricao": "\" Há muitos relatos sobre a origem do cão dos Baskerville, mas como venho da linhagem direta de Hugo Baskerville, e como recebi a história de meu pai, que também a recebeu do seu, coloquei toda a crença de que ela ocorreu exatamente como está aqui descrito a seguir.\" Cão dos Baskerville, considerado best- seller e melhor romance policial já escrito, Holmes volta em um enredo de horror gótico em que as pistas são estranhas e os suspeitos não são poucos. Baseado em lendas locais sobre cães sobrenaturais e fantasmas que buscam vingança, é mais um caso brilhante para o imbatível detetive de Baker Street resolver.",
        "editora": "Pandorga",
        "numeroPaginas": 175,
        "paisOrigem": "Brasil",
        "titulo": "O Cão de Baskerville",
        "status": 3,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/o_cao_de_baskerville?alt=media&token=69ff831f-2792-44d4-b6cf-4dad3d5a2b10",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089149,
        "dataHoraAlteracao": 1601050089149,
        "id": 29
    },
    {
        "firebaseCodigo": "JvcEIDjXqAEIqvxVRQXB",
        "anoEdicao": "2019",
        "autor": "W. Bruce Cameron",
        "descricao": "Bella, uma linda cadelinha vira-lata, adotou Lucas, e ele não teve outra opção senão adotá-la também. A alegria da cachorra cativou o jovem e os tornou inseparáveis, como acontece nas melhores amizades. Porém, muitos empecilhos na vida do rapaz impedem que ele mantenha a cachorra consigo, e Lucas é forçado a arrumar um lar temporário em outra cidade para Bella. Mas nenhuma distância e nenhum perigo poderia separar esses dois, e ela cruzará montanhas e florestas em sua busca pelo caminho de casa.<br /><br />Com uma história de derreter o coração sobre lealdade e apreço, A caminho de casa é um livro emocionante sobre os laços mais profundos que temos com nossos melhores amigos peludos. Assim como em Quatro vidas de um cachorro, A caminho de casa mostra a infinitude do amor de um cão e como esses animais podem atravessar todas as barreiras apenas para ficar com os seus humanos.",
        "editora": "Alice Melo",
        "numeroPaginas": 320,
        "paisOrigem": "Brasil",
        "titulo": "A Caminho de Casa",
        "status": 3,
        "isbn10": "0",
        "isbn13": "9788595084704",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/a_caminho_de_casa?alt=media&token=7e5ecd8e-8a27-42bf-b3e0-47a14eaeceb9",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089149,
        "dataHoraAlteracao": 1601050089149,
        "id": 30
    },
    {
        "firebaseCodigo": "KNKXJhil2doAPEj2XduY",
        "anoEdicao": "2017",
        "autor": "Annie Darling",
        "descricao": "Era uma vez uma pequena livraria em Londres, onde Posy Morland passou a vida perdida entre as páginas de seus romances favoritos.\nAssim, quando Lavinia, a excêntrica dona da Bookends, morre e deixa a loja para Posy, ela se vê obrigada a colocar os livros de lado e encarar o mundo real. Porque Posy não herdou apenas um negócio quase falido, mas também a atenção indesejada do neto de Lavinia, Sebastian, conhecido como o homem mais grosseiro de Londres.\nPosy tem um plano astucioso e seis meses para transformar a Bookends na livraria dos seus sonhos — isso se Sebastian deixá-la em paz para trabalhar. Enquanto Posy e os amigos lutam para salvar sua amada livraria, ela se envolve em uma batalha com Sebastian, com quem começou a ter fantasias um tanto ardentes...\nResta saber se, como as heroínas de seus romances favoritos, Posy vai conseguir o seu “felizes para sempre”.\nA história de Posy é a primeira da série A Livraria dos Corações Solitários, que vai retratar cada um dos funcionários da livraria, um “alegre bando de desajustados”, que por uma razão ou outra desistiram do amor e, ainda assim, o encontram quando menos esperam.",
        "editora": "Verus ",
        "numeroPaginas": 304,
        "paisOrigem": "Brasil",
        "titulo": "A Pequena Livraria dos Corações Solitários",
        "status": 2,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 8,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/a_pequena_livraria_dos_coracoes_solitarios?alt=media&token=8b541b84-b57a-4d5b-a00c-a2a0f838d0f9",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089150,
        "dataHoraAlteracao": 1601050089150,
        "id": 60
    },
    {
        "firebaseCodigo": "KRibE7idrc7EuSkiElXj",
        "anoEdicao": "2016",
        "autor": "Padre Reginaldo Manzotti",
        "descricao": "Não há, nas Sagradas Escrituras, quem saia indiferente de um encontro com Jesus. Suas palavras misericordiosas e sua postura acolhedora tocam de tal maneira o coração de quem O vê que é impossível não se tornar Seu discípulo. Em Encontros, Padre Reginaldo Manzotti, sucesso incomparável de vendas e de público, vem nos recordar de que o encontro transformador com Jesus Cristo não é algo que se restringe ao passado, mas pode ocorrer hoje mesmo, com todos nós. Partindo do exemplo de algumas das personagens bíblicas que tiveram a vida transformada pela misericórdia do Senhor, ele nos faz lembrar que o amor de Cristo quer nos ajudar a vencer todos aqueles flagelos que abalam nossa fé e nos impedem de viver com plenitude: as frustações, as angústias, a tristeza, o medo, a cegueira espiritual, o vazio interior, a baixa autoestima, as decepções... Também nós somos chamados a ser como a samaritana, Mateus, Maria Madalena, Pedro, Paulo, Nicodemos, Zaqueu e os discípulos de Emaús. Jesus quer vir ao nosso encontro. Ele nos espera já! Iremos impedi- lo de transformar por completo as nossas vidas?",
        "editora": "Petra",
        "numeroPaginas": 159,
        "paisOrigem": "Brasil",
        "titulo": "Encontros ",
        "status": 3,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/encontros_?alt=media&token=7aad1579-4616-44ce-a444-75175f04a222",
        "subtitulo": "Sinais do Sagrado",
        "categoria": "Católico",
        "dataHoraCriacao": 1601050089150,
        "dataHoraAlteracao": 1601050089150,
        "id": 31
    },
    {
        "firebaseCodigo": "LWmW4fUlS5A9qWIP4uBE",
        "anoEdicao": "2013",
        "autor": "Nicholas Sparks",
        "descricao": "ROMANCE",
        "editora": "Arqueiro",
        "numeroPaginas": 303,
        "paisOrigem": "Brasil",
        "titulo": "Uma curva na estrada ",
        "status": 3,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/uma_curva_na_estrada_?alt=media&token=12be27f6-480a-4640-8946-7ef3e0b87cb3",
        "subtitulo": "uma curva na estrada",
        "categoria": "Romance",
        "dataHoraCriacao": 1601050089151,
        "dataHoraAlteracao": 1601050089151,
        "id": 32
    },
    {
        "firebaseCodigo": "Lm82Rbq9NCD84BveIyqH",
        "anoEdicao": "2007",
        "autor": "J.K. Rowling",
        "descricao": "Os contos de Beedle, o Bardo é uma coletânea de histórias populares para jovens bruxos e bruxas, contadas há seculos à hora de dormir, daí serem o \" Caldeirão Saltitante\" é a \"Fonte da Sorte\" tão conhecidas de muitos alunos de Hogwarts quanto \" A gata borralheira \" e \"A bela adormecida\" das crianças trouxas( não mágicas). As histórias de Beedle se assemelham aos nossos contos de fadas sob muitos aspectos; por exemplo, a virtude é normalmente premiada é o vício castigado. Apresentam, porém, uma diferença evidente.                                                               Os contos de Beedle, O Bardo contém cinco histórias repletas de aventura, astúcia, desgostos e, naturalmente, magia. Traduzida das runas originais por Hermione Granger e apresentada aqui com extensos comentários de Alvo Dumbledore, esta maravilhosa edição esclarece esses contos clássicos aos leitores modernos. Com introdução, notas e ilustrações de J.K. Rowling, esta coleção emocionará e dará imenso prazer a bruxos e trouxas também.",
        "editora": "Rocco",
        "numeroPaginas": 107,
        "paisOrigem": "Brasil",
        "titulo": "Os contos de Beedle o Bardo",
        "status": 3,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/os_contos_de_beedle_o_bardo?alt=media&token=5ec2574a-f49e-4058-87a4-6450406424a7",
        "subtitulo": "Os contos de Beedle",
        "categoria": "Magia",
        "dataHoraCriacao": 1601050089151,
        "dataHoraAlteracao": 1601050089151,
        "id": 33
    },
    {
        "firebaseCodigo": "MLki7WA0QBs2Ddiq0g5V",
        "anoEdicao": "2013",
        "autor": "John Green",
        "descricao": "Hazel é uma paciente terminal. Ainda que, por um milagre da medicina, seu tumor tenha encolhido bastante — o que lhe dá a promessa de viver mais alguns anos — o último capítulo de sua história foi escrito no momento do diagnóstico. Mas em todo bom enredo há uma reviravolta, e a de Hazel se chama Augustus Waters, um garoto bonito que certo dia aparece no Grupo de Apoio a Criança com Câncer. Juntos os dois vão preencher o pequeno infinito das páginas em branco de suas vidas.",
        "editora": "Intrinseca",
        "numeroPaginas": 219,
        "paisOrigem": "Brasil",
        "titulo": "A Culpa é Das Estrelas",
        "status": 2,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 0,
        "dataCompra": "2019",
        "preco": "0,00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/a_culpa_e_das_estrelas?alt=media&token=341a78fc-25a6-4d58-9a07-153627a95152",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089151,
        "dataHoraAlteracao": 1601050089151,
        "id": 34
    },
    {
        "firebaseCodigo": "MghNuWwxLfJxAqbMvT6C",
        "anoEdicao": "2010",
        "autor": "Gianfrancesco Guarnieri",
        "descricao": "Eles não usam Black- Tie aguda observação da classe operária brasileira; uma classe que, nos últimos tempos, está se conduzindo praticamente sem líderes, em momento histórico em que suas reivindicações e seus gritos de protesto nascem quase diariamente como explosão inadiável, como que a demonstrar que nada está bem, e não como consequência fria de cálculos políticos.",
        "editora": "Civilização Brasileira",
        "numeroPaginas": 108,
        "paisOrigem": "Brasil",
        "titulo": "Eles Não Usam Black - Tie",
        "status": 3,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 24,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/eles_nao_usam_black___tie?alt=media&token=09c22e54-0f9b-48e5-a971-bc1763af4ee3",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089151,
        "dataHoraAlteracao": 1601050089151,
        "id": 35
    },
    {
        "firebaseCodigo": "MsIG6SfldS0LMCSj1dj0",
        "anoEdicao": "2005",
        "autor": "Marcos Rey",
        "descricao": "Um homem é assassinado no apartamento 222 do Emperor Park Hotel. O único que viu o corpo foi Léo, o mensageiro. Mas ninguém acredita em suas histórias, a não ser seus amigos Gino, Ângela e Guima. Léo é apenas um garoto e seus inimigos são ricos e poderosos. sem ter provas nenhuma contra elas, acaba perdendo o emprego e sendo procurado pela polícia, achando que tem problema de cabeça. Quem conseguirá desvendar o mistério do cinco estrelas?",
        "editora": "global editora",
        "numeroPaginas": 144,
        "paisOrigem": "Brasil",
        "titulo": "O Mistério do 5 Estrelas (Léo, Gino e Ângela, #1)",
        "status": 3,
        "isbn10": "8526009982",
        "isbn13": "9788526009981",
        "numeroEdicao": 2,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/o_misterio_do_5_estrelas__leo__gino_e_angela__%231_?alt=media&token=c67ace2f-1fbc-4809-85dc-edbe148d6507",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089152,
        "dataHoraAlteracao": 1601050089152,
        "id": 36
    },
    {
        "firebaseCodigo": "NazYLAOCogUN68hdLKAM",
        "anoEdicao": "2015",
        "autor": "Padre Marcelo Rossi",
        "descricao": "Philia é o amor dos pais por seus filhos, o amor entre irmãos, entre amigos. \n\nApós o sucesso de Ágape e Kairós, com mais de 12 milhões de exemplares vendidos, Padre Marcelo trata as questões de forma simples e direta, com exemplos práticos e orações, apresentando caminhos de esperança e superação através do amor fraternal. \n\nSão 14 capítulos que buscam curar os males da alma: depressão, ansiedade, tristeza, pessimismo, medo, remorso, vício, desemprego, maledicência, inveja, ciúme, ira, ingratidão e autoimagem. ",
        "editora": "Principium",
        "numeroPaginas": 136,
        "paisOrigem": "Brasil",
        "titulo": "Philia",
        "status": 2,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 0,
        "dataCompra": "2019",
        "preco": "0,00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/philia?alt=media&token=71220f28-bce2-4bf3-99f7-3e91eb2ad94c",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089152,
        "dataHoraAlteracao": 1601050089152,
        "id": 37
    },
    {
        "firebaseCodigo": "NvIRzQWTtkfi7JbOLnAh",
        "anoEdicao": "2013",
        "autor": "Nicholas Sparks",
        "descricao": "O amor tem o poder de superar até os mais difíceis obstáculos.",
        "editora": "Arqueiro",
        "numeroPaginas": 287,
        "paisOrigem": "Brasil",
        "titulo": "O Milagre ",
        "status": 3,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/o_milagre_?alt=media&token=8337fada-7c20-4646-8d43-f3e9bc755c65",
        "subtitulo": "não",
        "categoria": "Romance",
        "dataHoraCriacao": 1601050089152,
        "dataHoraAlteracao": 1601050089152,
        "id": 38
    },
    {
        "firebaseCodigo": "OnKCwz5JR7LrThC3Jt6G",
        "anoEdicao": "2015",
        "autor": "Padre Marcelo Rossi",
        "descricao": "RUAH é a palavra hebraica que significa vento, espírito, alento, hálito divino, sopro de vida. Este livro vai ajudar o leitor a perceber que Deus também se preocupa com o seu corpo. Cuidar da própria saúde é estar em sintonia com o amor do Pai, pois o corpo é o templo do Espírito Santo. Deus irá permitir que você modifique seus hábitos e tenha uma vida saudável. RUAH, a força criadora que gera saúde, força, beleza, e sabedoria. RUAH, o sopro divino que nos alimenta.",
        "editora": "principium",
        "numeroPaginas": 95,
        "paisOrigem": "Brasil",
        "titulo": "Ruah",
        "status": 2,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 0,
        "dataCompra": "2019",
        "preco": "0,00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/ruah?alt=media&token=30586957-457b-4c56-8a6f-8f0fb4f514bf",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089153,
        "dataHoraAlteracao": 1601050089153,
        "id": 39
    },
    {
        "firebaseCodigo": "OxfKWhBSTvwfIIwyssmO",
        "anoEdicao": "2019",
        "autor": "Sherlock Holmes",
        "descricao": "\"Algo ruim aconteceu durante a noite no número 3, em Lauriston Gardens, ao lado da estrada de Brixton Roaf.Nosso oficial que fazia a ronda viu uma luz acesa lá por volta das duas da manhã e, como a casa estava vazia, suspeitou de que algo estava errado. Ele encontrou a porta aberta e, no quarto da frente que não tinha mobília, viu o corpo de um cavalheiro, bem vestido, com cartões em seu bolso com o nome de Enoch J. Drebber. Não houve nenhum roubo, nem havia evidências de como ele tinha sido morto.",
        "editora": "Pandorga",
        "numeroPaginas": 135,
        "paisOrigem": "Brasil",
        "titulo": "Um Estudo Em Vermelho",
        "status": 3,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/um_estudo_em_vermelho?alt=media&token=104fdf84-2a05-4f3f-826c-8d9b49c6fcf1",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089153,
        "dataHoraAlteracao": 1601050089153,
        "id": 40
    },
    {
        "firebaseCodigo": "P9VJq7g0vKbtz4eUnXIa",
        "anoEdicao": "2009",
        "autor": "Stephenie Meyer",
        "descricao": "Quando se ama aquele que vai matá- la, não restam alternativas. Como se pode correr, como se pode lutar, quando essa atitude magoaria o amado? Se sua vida é tudo o que você tem para dar ao amado, como não dá- la\". Estar irrevogavelmente apaixonada por um vampiro é tanto uma fantasia como um pesadelo, costurados em uma perigosa realidade para Bella Swan. Empurrada em uma direção por sua intensa paixão por Edward Cullen, e em outra, por sua profunda ligação com o lobisomem Jacob Black, ela resistiu a um tumultuado ano de tentação, perda e conflito, para atingir o momento da decisão final. Essa escolha fatal entre fazer parte do obscuro, mas sedutor, mundo dos imortais ou seguir uma vida totalmente humana se tornou o marco que poderá transformar o destino dos dois clãs: vampiros e lobisomens.Agora que Bella tomou sua decisão, uma corrente de acontecimentos sem precedentes se desdobrará, com consequências devastadoras. No momento em que as feridas parecem prontas para ser cicatrizadas, e os desgastantes confrontos da vida de Bella, resolvidos, isso pode significar a destruição. Para todos. Para sempre. Assombroso e de tirar o fôlego, Amanhecer, a aguardada conclusão da saga Crepúsculo, esclarece os mistérios e os segredos desse fascinante épico romântico que tem arrebatado milhões de leitores.",
        "editora": "intrinseca",
        "numeroPaginas": 576,
        "paisOrigem": "Brasil",
        "titulo": "Amanhecer (Crepúsculo, #4)",
        "status": 2,
        "isbn10": "8598078468",
        "isbn13": "9788598078465",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0,00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/amanhecer__crepusculo__%234_?alt=media&token=1da62bb7-9ab9-4c7c-a3ca-cb70c3c98ed0",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089153,
        "dataHoraAlteracao": 1601050089153,
        "id": 41
    },
    {
        "firebaseCodigo": "PdqhbWF2h5A5hZjfuu3n",
        "anoEdicao": "2014",
        "autor": "Santa Tereza d'Ávila",
        "descricao": "Surpreende que um livro escrito há tanto tempo tenha tanto que nos dizer ainda hoje. A surpresa se desfaz, no entanto, quando nos damos conta de que As Moradas do Castelo Interior é um convite à vida interior e à comunhão com Deus, bem como uma longa exortação acerca dos percalços encontrados neste caminho. \n\nNesta obra- prima, Santa Tereza d'Avila se vale de uma metáfora para organizar seu ensino: nossa alma é um castelo onde há muitos aposentos, assim como no céu há muitas moradas. \" Umas no alto, outras embaixo, outras nos lados, e, no centro, no meio de todas estas, está a principal, que é onde ocorrem as coisas mais secretas entre Deus e a alma.\" A porta de entrada deste castelo é a oração.\n\nEste verdadeiro clássico da espiritualidade cristã e da literatura espanhola vem a público às vésperas das comemorações dos 500 anos do nascimento de Santa Tereza numa edição enriquecida pela apresentação inédita do frei Patrício Sciadini, o.c.d., pelo retrato de Santa Tereza redigido pelo escritor francês Ernest Hello e pela tradição do premiado romancista Antonio Fernando Borges.",
        "editora": "É Realizações",
        "numeroPaginas": 254,
        "paisOrigem": "Brasil",
        "titulo": "As moradas do castelo interior",
        "status": 2,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 0,
        "dataCompra": "2019",
        "preco": "0,00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/as_moradas_do_castelo_interior?alt=media&token=c54be3fd-8af5-42c1-8b08-3419dad158ad",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089154,
        "dataHoraAlteracao": 1601050089154,
        "id": 42
    },
    {
        "firebaseCodigo": "QGCwWXattZAS55wMvDz3",
        "anoEdicao": "2010",
        "autor": "Padre Marcelo Rossi",
        "descricao": "Em seu livro Ágape, com prefácio de Gabriel Chalita, o sacerdote católico tece suas reflexões sobre passagens do Evangelho de São João e convida o leitor a enveredar por inspiradas orações.\n\nOs dicionários definem a palavra \"ágape\" como a refeição promovida pelos primitivos cristãos a fim de celebrar o rito eucarístico. O rito confraternizava ricos e pobres em torno de ideais como amizade, caridade e amor. Em Ágape, livro lançado pela Editora Globo, Padre Marcelo Rossi retoma e amplia o sentido original do conceito: \"Ágape é uma palavra de origem grega que significa o amor divino. O amor de Deus pelos seus filhos e ainda o amor que as pessoas sentem umas pelas outras inspiradas nesse amor divino\", assinala no texto de introdução do volume. \n\nCom sua abordagem de comunicação moderna, original e leve, padre Marcelo leva conforto espiritual e ensinamentos da Igreja Católica para milhões de brasileiros por meio de programas de rádio e TV. O estilo claro, direto e sereno que o transformou em fenômeno midiático está impregnado, agora, em Ágape, obra literária em que o autor apresenta trechos selecionados do Evangelho de São João e os reinterpreta à luz do significado do amor divino no mundo contemporâneo. \n\nMais do que se apresentar como estudo teológico sobre os escritos narrados pelo apóstolo, o livro tem explícita intenção oracional. Nesse sentido, trata-se de um diálogo entre o autor, na condição de padre, e seus filhos em busca da boa palavra. Cada capítulo do volume se encerra com uma oração envolvendo os temas ali examinados pelo autor, como a convidar os leitores para um momento de introspecção e de acolhimento das mensagens de Jesus segundo São João. \n\nA escolha do Evangelho de São João entre tantas outras possibilidades dentro da Bíblia é justificada por Padre Marcelo pela beleza da estrutura literária e pela impressionante delicadeza com que são descritos os momentos da vida de Jesus - como se o apóstolo não se contentasse em apenas narrar os fatos, mas quisesse nos trazer para dentro da situação descrita. Compartilhar a beleza das narrações do evangelista com os leitores é outro dos objetivos declarados do autor, que busca, com Ágape, incentivar cada vez mais a leitura da Palavra de Deus.",
        "editora": "Principium",
        "numeroPaginas": 128,
        "paisOrigem": "Brasil",
        "titulo": "Ágape",
        "status": 2,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 0,
        "dataCompra": "2019",
        "preco": "0,00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/agape?alt=media&token=b16b9c1a-b9bb-4156-9cec-9963418268f4",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089154,
        "dataHoraAlteracao": 1601050089154,
        "id": 43
    },
    {
        "firebaseCodigo": "QzrZEnDLxbTRDbfZDajD",
        "anoEdicao": "2016",
        "autor": "Dom Pedro Fedaldo",
        "descricao": "Devoção a Misericórdia, Orações de Santa Faustina, a Via- Sacra, Terço da Misericórdia, Novena da Misericórdia..etc..",
        "editora": "Apostolado da Misericórdia",
        "numeroPaginas": 64,
        "paisOrigem": "Brasil",
        "titulo": "Novena à Divina Misericórdia",
        "status": 3,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/novena_a_divina_misericordia?alt=media&token=d859b3b7-899f-494e-b8a5-fecf2a7311ff",
        "subtitulo": "",
        "categoria": "Católico",
        "dataHoraCriacao": 1601050089154,
        "dataHoraAlteracao": 1601050089154,
        "id": 112
    },
    {
        "firebaseCodigo": "RG7PVMyCdOiyTRiy1DMg",
        "anoEdicao": "2015",
        "autor": "J.K Rowling",
        "descricao": "O segundo ano de Harry na escola de Hogwarts está cheio de novos perigos e horrores, incluindo um professor totalmente metido chamado Gilderoy Lockhart, o espírito de uma garota chamada Murta que Geme, que assombra o banheiro das meninas, e a embaraçosa atenção da irmãzinha caçula do Rony, Gina.Mas tudo isso parece pequeno quando um problema de verdade aparece e alguém – ou alguma coisa – começa a petrificar os alunos de Hogwarts. Será que foi Draco Malfoy, que anda ainda mais venenoso que o normal? Será que foi Hagrid, cujo passado começa a vir à tona? Talvez tenha sido o suspeito número um de toda a escola... o próprio Harry!",
        "editora": "Rocco",
        "numeroPaginas": 256,
        "paisOrigem": "Brasil",
        "titulo": "Harry Potter e a câmara secreta (Harry Potter, Part 2)",
        "status": 2,
        "isbn10": "8532529968",
        "isbn13": "9788532529961",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/harry_potter_e_a_camara_secreta__harry_potter__part_2_?alt=media&token=7ad70569-6914-4042-963c-4e31b47f30fa",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089154,
        "dataHoraAlteracao": 1601050089154,
        "id": 44
    },
    {
        "firebaseCodigo": "RnHvxegOoND6NocHS5sU",
        "anoEdicao": "2017",
        "autor": "Padre Germano",
        "descricao": "Conta a Espiritualidade de Santa Gemma Galgani",
        "editora": "Paulus",
        "numeroPaginas": 254,
        "paisOrigem": "Brasil",
        "titulo": "Diário de Santa Gemma Galgani",
        "status": 1,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/diario_de_santa_gemma_galgani?alt=media&token=e16c773c-44ac-4bfd-bb5a-7a77c4a4210c",
        "subtitulo": "Santa Gemma Galgani",
        "categoria": "Católico",
        "dataHoraCriacao": 1601050089155,
        "dataHoraAlteracao": 1601050089155,
        "id": 45
    },
    {
        "firebaseCodigo": "SrTYsr5hJQvnhhJLDcsd",
        "anoEdicao": "2014",
        "autor": "Nicholas Sparks",
        "descricao": "Há três anos, Theresa Osborne se divorciou do marido após ter sido traída. Desde então, não acredita no amor e não se envolveu seriamente com ninguém. Convencida pela chefe de que precisa de um tempo para si, ela resolve passar férias em Cape Cod. Lá, Theresa encontra na praia uma garrafa arrolhada com uma folha de papel enrolada dentro.Ao abri-la, descobre uma mensagem que começa assim: \"Minha adorada Catherine, sinto a sua falta, querida, como sempre, mas hoje está sendo especialmente difícil porque o oceano tem cantado para mim, e a canção é a da nossa vida juntos.\"Comovida pelo texto apaixonado, Theresa decide encontrar seu misterioso autor, que assina apenas \"Garrett\". Após uma incansável busca, durante a qual descobre novas cartas que mexem cada vez mais com seus sentimentos, Theresa vai procurá-lo em uma cidade litorânea da Carolina do Norte.Quando o conhece, descobre que há três anos Garrett chora por seu amor perdido, mas também percebe que ele pode estar pronto para se entregar a uma nova história. E, para sua própria surpresa, ela também.Unidos pelo acaso, Theresa e Garrett estão prestes a viver uma história comovente que reflete nossa profunda esperança de encontrar alguém e sermos felizes para sempre.\"Quem adorou As pontes de Madison e O encantador de cavalos não vai se decepcionar. Uma carta de amor segue a mesma linha romântica, portanto, se você está em busca de um livro para chorar, não precisa procurar mais.\" – CNN Book Review\"Transbordando emoção e suspense, Uma carta de amor leva o leitor em busca da verdade sobre um homem e as suas memórias e, ao mesmo tempo, fala da fragilidade devastadora e da força imensa do amor.\" – Goodreads",
        "editora": "Editora Arqueiro",
        "numeroPaginas": 288,
        "paisOrigem": "Brasil",
        "titulo": "Uma Carta de Amor",
        "status": 3,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/uma_carta_de_amor?alt=media&token=67e5631b-1dec-458b-9a90-39242ae5c26e",
        "subtitulo": "",
        "categoria": "Ficção",
        "dataHoraCriacao": 1601050089155,
        "dataHoraAlteracao": 1601050089155,
        "id": 46
    },
    {
        "firebaseCodigo": "T51Fsl7jLnD3Aeg11Og3",
        "anoEdicao": "2001",
        "autor": "Marçal Aquino",
        "descricao": "Descer do ônibus no lugar errado e ir parar numa cidade deserta já não é nada agradável para um grupo de amigos que tinha decidido acampar. Isto, porém, é apenas o começo. Durante a noite, tem início uma série de fatos que fazem a turma se perguntar se aquele local é tão abandonado quanto parece.",
        "editora": "ática",
        "numeroPaginas": 96,
        "paisOrigem": "Brasil",
        "titulo": "O Mistério da Cidade-Fantasma",
        "status": 3,
        "isbn10": "8508045360",
        "isbn13": "9788508045365",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/o_misterio_da_cidade_fantasma?alt=media&token=2c8230f6-263b-40c0-9780-91bc5a53bb7b",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089155,
        "dataHoraAlteracao": 1601050089155,
        "id": 47
    },
    {
        "firebaseCodigo": "U2BfurDcfK4NXBT1zsWG",
        "anoEdicao": "2002",
        "autor": "Mark W. Baker",
        "descricao": "Como os ensinamentos de Cristo podem nos ajudar a resolver os problemas do cotidiano e aumentar nossa saúde emocional!!",
        "editora": "Sextante",
        "numeroPaginas": 191,
        "paisOrigem": "Brasil",
        "titulo": "Jesus O Maior Psicólogo que já existiu",
        "status": 3,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/jesus_o_maior_psicologo_que_ja_existiu?alt=media&token=d23e1480-886b-4c0a-b30c-fcb0b0b02a51",
        "subtitulo": "",
        "categoria": "Auto Ajuda ",
        "dataHoraCriacao": 1601050089155,
        "dataHoraAlteracao": 1601050089155,
        "id": 107
    },
    {
        "firebaseCodigo": "UntrGIdeyvPRJN8DzG81",
        "anoEdicao": "2007",
        "autor": "J.K. Rowling",
        "descricao": "Se você algum dia quis saber como surgiu o pomo de ouro, qual a origem dos balaços ou por que o time dos Vagabundos de Wigtown ( Wigtown Wanders) tem a estampa de cutelos de açougueiro no uniforme, você precisa ler Quadribol através dos séculos. Este volume inestimável é consultado por jovens fãs do quadribol quase que diariamente. A renda obtida na venda deste livro reverterá para a Comic Relief, que destinará o dinheiro para continuar a melhorar e salvar vidas- um trabalho mais importante e mais surpreendente do que a segunda captura do pomo de ouro, em três segundos e meio, por Rodrigo Plumpton, em 1921.",
        "editora": "Rocco",
        "numeroPaginas": 105,
        "paisOrigem": "Brasil",
        "titulo": "Quadribol",
        "status": 3,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/quadribol?alt=media&token=0ac0235e-ee46-4d67-820c-9c1d5013ecdc",
        "subtitulo": "Através dos Séculos",
        "categoria": "Magia",
        "dataHoraCriacao": 1601050089156,
        "dataHoraAlteracao": 1601050089156,
        "id": 48
    },
    {
        "firebaseCodigo": "VaqY6sk4TOIA40DPIk3k",
        "anoEdicao": "2019",
        "autor": "Padre José Rodrigues Cabezas",
        "descricao": "\"Santa Rita, advogada das causas impossíveis, resumo das maravilhas da graça que a divina Onipotência manifesta sem cessar para admiração nossa, como o foi das gerações passadas e o será das vindouras. Deus é admirável em seus santos\".",
        "editora": "Minha Biblioteca Católica",
        "numeroPaginas": 207,
        "paisOrigem": "Brasil",
        "titulo": "A vida de Santa Rita de Cássia",
        "status": 2,
        "isbn10": "0",
        "isbn13": "9788554875183",
        "numeroEdicao": 208,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/a_vida_de_santa_rita_de_cassia?alt=media&token=b32e2aeb-4d97-4100-9a6e-ac1b9494ded4",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089156,
        "dataHoraAlteracao": 1601050089156,
        "id": 49
    },
    {
        "firebaseCodigo": "WekPyTHVW9sQqZG9nIzW",
        "anoEdicao": "2020",
        "autor": "Pe. Reginaldo Manzotti",
        "descricao": "Em outubro teve seu descobrimento",
        "editora": "Petra",
        "numeroPaginas": 59,
        "paisOrigem": "Brasil",
        "titulo": "Nossa Senhora Aparecida",
        "status": 3,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/nossa_senhora_aparecida?alt=media&token=6103a588-f594-45b8-8f8d-aaef40fadc8e",
        "subtitulo": "História dos Santos ",
        "categoria": "Católico",
        "dataHoraCriacao": 1601050089156,
        "dataHoraAlteracao": 1601050089156,
        "id": 50
    },
    {
        "firebaseCodigo": "Xc8mCLt7ZIEeEVSV1jkG",
        "anoEdicao": "2018",
        "autor": "Pedro Siqueira",
        "descricao": "Precisamos ter a consciência de que somos filhos amados do altíssimo.Ele anseia pelo nosso contato e quer que tenhamos mais e mais intimidade com o mundo espiritual.",
        "editora": "Sextante ",
        "numeroPaginas": 93,
        "paisOrigem": "Brasil",
        "titulo": "Você pode falar com Deus",
        "status": 2,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 0,
        "dataCompra": "2019",
        "preco": "0,00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/voce_pode_falar_com_deus?alt=media&token=2c8ac5f5-672f-4ef4-8797-eb0c78833da2",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089156,
        "dataHoraAlteracao": 1601050089156,
        "id": 51
    },
    {
        "firebaseCodigo": "XrfBIfNwSp9jMETVrcvG",
        "anoEdicao": "2018",
        "autor": "Nicholas Sparks",
        "descricao": "Novo romance de Nicholas Sparks.Traduzidos para 50 idiomas, os livros de Nicholas Sparks já venderam mais de 100 milhões de livros no mundo.Hope Anderson está numa encruzilhada. Aos 36 anos, ela namora o mesmo homem há seis, sem perspectiva de casamento. Quando seu pai é diagnosticado com uma grave doença degenerativa, ela resolve passar uma semana na casa de praia da família, na Carolina do Norte, para pensar nas difíceis decisões que precisa tomar em relação ao próprio futuro.Tru Walls nasceu numa família rica no Zimbábue. Nunca esteve nos Estados Unidos, até receber uma carta de um homem que diz ser seu pai biológico, convidando-o a encontrá-lo numa casa de praia na Carolina do Norte. Intrigado ele aceita e faz a viagem.Quando os dois estranhos se cruzam na praia, nasce entre eles uma ligação eletrizante e imediata. Nos dias que se seguem, os sentimentos que desenvolvem um pelo outro os obrigam a fazer escolhas que colocam à prova suas lealdades e reais chances de felicidade.O novo romance de Nicholas Sparks, na tradição de Diário de uma Paixão e Noites de Tormenta, aborda as muitas facetas do amor, os arrependimentos e a esperança que nunca morre, trazendo à tona a pergunta: por quanto tempo um sonho consegue sobreviver?",
        "editora": "Arqueiro",
        "numeroPaginas": 271,
        "paisOrigem": "Brasil",
        "titulo": "Almas Gêmeas",
        "status": 2,
        "isbn10": "8580418631",
        "isbn13": "9788580418637",
        "numeroEdicao": 5,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/almas_gemeas?alt=media&token=d9c3cb2f-0781-4600-beb4-9b1a7b963f4f",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089157,
        "dataHoraAlteracao": 1601050089157,
        "id": 52
    },
    {
        "firebaseCodigo": "YF9e1BiJxeCRz3bTT22l",
        "anoEdicao": "2018",
        "autor": "Vozes",
        "descricao": "Para Luís Maria Grignion de Monfort, o segredo para aqueles que procuram a santidade está na postura de submissão que Maria assume diante de Deus, tornando- se escrava dele. Neste opúsculo, Monfort traz algumas reflexões sobre como a consagração a Maria descrita na obra O tratado da verdadeira devoção à Santíssima Virgem se concretiza na vida do cristão. Assim como Maria tornou- se escrava - e permanece nossa grande protetora junto a seu Filho -, também o cristão é convidado a consagrar- se como escravo incondicional de Maria para dela obter toda a graça.",
        "editora": "Vozes",
        "numeroPaginas": 54,
        "paisOrigem": "Brasil",
        "titulo": "O Segredo de Maria",
        "status": 2,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/o_segredo_de_maria?alt=media&token=3cce7fc5-ac4c-4feb-9868-94f3e4b5bad1",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089157,
        "dataHoraAlteracao": 1601050089157,
        "id": 53
    },
    {
        "firebaseCodigo": "YuoXGPhp7AVD4WmWlRgj",
        "anoEdicao": "2017",
        "autor": "Jennifer Donnelly",
        "descricao": "Escondido na Biblioteca da Fera está um misterioso livro. Bela está prestes a descobri-lo e visitar um novo e fascinante mundo. Mas será que tudo nesse novo é o que parece ser? Será que Bela conseguirá encontrar a sua casa? Ou a História acabará por dominá- lá e nunca mais deixará partir?",
        "editora": "Universo dos Livros",
        "numeroPaginas": 302,
        "paisOrigem": "Brasil",
        "titulo": "A Bela e a Fera - Perdida em um Livro",
        "status": 2,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 0,
        "dataCompra": "2019",
        "preco": "0,00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/a_bela_e_a_fera___perdida_em_um_livro?alt=media&token=00432074-2b30-4c50-a06c-8f043012cd9e",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089157,
        "dataHoraAlteracao": 1601050089157,
        "id": 54
    },
    {
        "firebaseCodigo": "ZJOplv1Mgiz4y1Zn7hUc",
        "anoEdicao": "2017",
        "autor": "Pedro Siqueira",
        "descricao": "Psicóloga Experiente, Gabriela sempre tratou a religião como crendice ou truque da mente. Quando sua mãe fica doente, ela acaba se aproximando do capelão do hospital, padre José, mais em busca de apoio do que por uma questão de fé. Após o falecimento da mãe, Gabriela mantém contato com o sacerdote, confortável pelo fato de ele não procurar convertê- la. Porém, depois de pouco mais de um mês, a psicóloga tem uma notícia devastadora: uma grave doença se alastra por seu corpo. Como lidar com a mente dos pacientes se a sua própria já não parece funcionar mais? Ao revelar o caso a padre José, Gabriela recebe um conselho: viajar para Lourdes, uma cidade famosa pelos milagres de cura. Mesmo sem a mínima confiança e determinação, ela decide partir em peregrinação para lá. É nessa jornada que Gabriela começa a relembrar toda a sua vida desde a infância, e assim emergem muitas questões filosóficas e existenciais. Sem saber o que a aguarda na Europa, ela sente que uma presença poderosa a acompanha e que, talvez, la possa encontrar as respostas para as dúvidas que lhe afligem a alma. No primeiro livro de sua trilogia de ficção dedicada a Nossa Senhora, Pedro Siqueira mantém a escrita próxima do leitor sem deixar de lado assuntos profundos da espiritualidade, mas sempre mostrando que o melhor caminho está no nosso interior.",
        "editora": "Sextante",
        "numeroPaginas": 207,
        "paisOrigem": "Brasil",
        "titulo": "Senhora das águas",
        "status": 3,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/senhora_das_aguas?alt=media&token=85d7d17a-8474-47d8-8bb1-a211f401e6e6",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089158,
        "dataHoraAlteracao": 1601050089158,
        "id": 55
    },
    {
        "firebaseCodigo": "Zr6rHy1IsZVhBjZd7HCt",
        "anoEdicao": "1998",
        "autor": "Clarice Lispector",
        "descricao": "Uma escritora decidida a desvendar as profundezas da alma. Essa é Clarice Lispector, que escolheu a literatura como bússola em sua busca pela essência humana. Sua tentativa de transcender o cotidiano revela- se em personagens na iminência de um milagre, uma explosão ou uma singela descoberta. Todos suscetíveis aos acontecimentos do dia a dia. Vidas que se perdem e se encontram em labirintos formados por uma linguagem única, meticulosamente estruturada. E é por essa linguagem que Clarice Lispector constrói uma obra de caráter tão profundo quanto universal.",
        "editora": "Rocco",
        "numeroPaginas": 87,
        "paisOrigem": "Brasil",
        "titulo": "A Hora Da Estrela",
        "status": 3,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 0,
        "dataCompra": "2019",
        "preco": "0,00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/a_hora_da_estrela?alt=media&token=e348c5fd-aaea-40c5-84df-0a0340b1bf76",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089158,
        "dataHoraAlteracao": 1601050089158,
        "id": 56
    },
    {
        "firebaseCodigo": "aAuBMaEVRDPSF69RkL2p",
        "anoEdicao": "2020",
        "autor": "Padre Reginaldo Manzotti",
        "descricao": "Há uma Muralha entre você é a felicidade?                 Pois Deus quer derrubá- la... Os Israelitas caminhavam confiantes rumo à Terra Prometida. No meio do caminho, porém, depararam- se com as importantes muralhas da cidade de Jericó. Continuar parecia impossível...Mas não para Deus. Seguindo as instruções do Senhor, durante dias os hebreus tomaram consigo a Arca da Aliança, marcharam ao redor das muralhas, bradaram e tocaram trombetas. O resultado? As muralhas que impediam sua passagem vieram ao chão, e, finalmente, os israelitas puderam rumar em direção ao destino que Deus lhes reservara. Esta parece ser uma história antiga e sem muita importância para os dias de hoje, não é? De modo algum. Neste livro, Pe. Reginaldo Manzotti nos revela como, a exemplo do que aconteceu com nossos antecipados na fé, Deus continua derrubando muralhas — todas aquelas que nos separam de uma vida verdadeira plena.",
        "editora": "Petra",
        "numeroPaginas": 172,
        "paisOrigem": "Brasil",
        "titulo": "As Muralhas Vão Cair ",
        "status": 3,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/as_muralhas_vao_cair_?alt=media&token=005e096a-5a3e-4935-ba48-2ee48983c8b2",
        "subtitulo": "As Muralhas",
        "categoria": "Católico",
        "dataHoraCriacao": 1601050089159,
        "dataHoraAlteracao": 1601050089159,
        "id": 57
    },
    {
        "firebaseCodigo": "b1PAjEownEIcEkr85Lfz",
        "anoEdicao": "2015",
        "autor": "Nicholas Sparks",
        "descricao": "Aos 91 anos, com problemas de saude e sozinho no mundo, Ira Levinson sofre um terrivel acidente de carro. Enquanto luta para se manter consciente, a imagem de Ruth, sua amada esposa que morreu ha noveanos, surge diante dele.Mesmo sabendo que e impossivel que ela esteja ali, Ira se agarra a isso erelembra momentos de sua longa vida em comum: o dia em que se conheceram, o casamento, o amor dela pela arte, os dias sombrios da Segunda Guerra e seus efeitos sobre eles e suas familias. Perto dali, Sophia Danko, uma jovem estudante de historia da arte, acompanha a melhor amiga ate um rodeio. La e assediada pelo ex-namorado e acaba sendo salva por Luke Collins, o cauboi que acabou de vencer a competicao.Ele e Sophia comecam a conversar e logo percebem como e facil estaremjuntos. Luke e completamente diferente dos rapazes privilegiados da faculdade. Ele nao mede esforcos para ajudar a mae e salvar a fazenda da familia.Aos poucos, Sophia comeca a descobrir um novo mundo e percebe que Luke talvez tenha o poder de reescrever o futuro que ela havia planejado.Isso se o terrivel segredo que ele guarda nao puser tudo a perder.Ira e Ruth. Luke e Sophia. Dois casais de geracoes diferentes que o destino cuidara de unir, mostrando que, para alem do desespero, da dificuldade e da morte, a forca do amor sempre nos guia nesta longa jornada que e a vida.",
        "editora": "Arqueiro",
        "numeroPaginas": 361,
        "paisOrigem": "Brasil",
        "titulo": "Uma Longa Jornada (Em Portugues do Brasil)",
        "status": 3,
        "isbn10": "8580413885",
        "isbn13": "9788580413885",
        "numeroEdicao": 2,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/uma_longa_jornada__em_portugues_do_brasil_?alt=media&token=b74ec827-9535-413b-b92d-983242a62111",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089159,
        "dataHoraAlteracao": 1601050089159,
        "id": 58
    },
    {
        "firebaseCodigo": "bDtmHpgFCKMR5V62Sa8D",
        "anoEdicao": "2016",
        "autor": "Nicholas Sparks",
        "descricao": " “Um porto seguro tem todas as marcas registradas dos romances mais amados de Nicholas Sparks: uma história de amor, segredos e amizades sinceras.” Southport pode ser um bom lugar para recomeçar. Esse foi o pensamento de Katie quando ela chegou à pequena cidade da Carolina do Norte. Linda e reservada, a moça estava decidida a não criar laços com ninguém. Ou, pelo menos, essa era a intenção até conhecer Jo, sua vizinha extrovertida e brincalhona, e Alex Wheatley, o simpático dono do armazém, pai de duas crianças adoráveis. Apesar de relutante, Katie aos poucos firma raízes na comunidade e, depois de conhecer melhor a família e o bom coração de Alex, começa a abrir espaço em sua vida para o amor. No entanto, esse novo relacionamento faz com que ela se veja diante de antigos medos que pretendia deixar no passado. Confrontada pelos próprios fantasmas, Katie precisa decidir entre ceder a eles ou enfrentá-los. E, no momento mais difícil, ela descobrirá que o amor é o único porto seguro. Um dos livros mais intensos de Nicholas Sparks, Um porto seguro é promessa certeira de lágrimas, sorrisos e surpresas emocionantes.",
        "editora": "Arqueiro",
        "numeroPaginas": 298,
        "paisOrigem": "Brasil",
        "titulo": "Um Porto Seguro",
        "status": 2,
        "isbn10": "8580416086",
        "isbn13": "9788580416084",
        "numeroEdicao": 6,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/um_porto_seguro?alt=media&token=c511abb3-c4e3-4ff4-813f-c7af5b1c73b2",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089159,
        "dataHoraAlteracao": 1601050089159,
        "id": 59
    },
    {
        "firebaseCodigo": "c4iAxFh8X6lzXOpjlFDK",
        "anoEdicao": "2019",
        "autor": "Emily Bronte",
        "descricao": "Único romance da escritora inglesa Emily Bronte, O morro dos ventos uivantes retrata uma trágica história de amor e obsessão em que os personagens principais  são a obstinada e geniosa Catherine Earnshaw e seu irmão adotivo, Heathcliff. Grosseiro, humilhado e rejeitado, ele guarda apenas rancor no coração, mas tem com Catherine um relacionamento marcado por amor e, ao mesmo tempo, ódio. Essa ligação perdura mesmo com o casamento de Catherine com Edgar Linton. O Morro dos Ventos Uivantes era o nome da residência do senhor Heathcliff. \"Uivante\" era um adjetivo provinciano significativo, que descrevia a confusão atmosférica à qual aquela região estava exposta em dias de tempestade. Lá, de fato, devem soprar o tempo todo ventos puros e revigorantes; pode- se adivinhar a força do vento norte soprando sobre a propriedade por conta do ângulo excessivo de inclinação de alguns abetos atrofiados na parte de trás da casa; e por uma série de espinheiros cujos galhos se esticavam todos na mesma direção, como se ávidos por uma esmola do sol. Felizmente o arquiteto anteviu o fato de que a construção deveria ser resistente: as estreitas janelas estavam bem embutidas nas paredes, e as esquinas eram protegidas por pedregulhos salientes.",
        "editora": "Principis",
        "numeroPaginas": 368,
        "paisOrigem": "Brasil",
        "titulo": "O Morro dos Ventos Uivantes",
        "status": 3,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/o_morro_dos_ventos_uivantes?alt=media&token=476aaf50-dab2-417d-b034-e57faf076a4b",
        "subtitulo": "",
        "categoria": "Romance",
        "dataHoraCriacao": 1601050089160,
        "dataHoraAlteracao": 1601050089160,
        "id": 114
    },
    {
        "firebaseCodigo": "c6egicJdL5wb3pSQ8KuF",
        "anoEdicao": "2014",
        "autor": "Cecelia Ahern",
        "descricao": "Mas esse não é o caso de Holly e Gerry. Eles eram amigos de infância, portanto conseguiam saber o que o outro estava pensando e, até quando brigavam, eles se divertiam. Ninguém conseguia imagina -los separados. Até que o inesperado acontece e Gerry morre, deixando- a devastada. Conforme seu aniversário de 30 anos se aproxima, Holly descobre um pacote de cartas no qual Gerry, gentilmente, escreveu uma carta para cada mês da nova vida dela sem ele. Com ajuda de seus amigos e de sua família barulhenta e carinhosa, Holly consegue rir, chorar, cantar, dançar e ser mais corajosa do que nunca....Algumas pessoas esperam a vida inteira para encontrar sua alma gêmea..Existem amores que duram mais que uma vida.",
        "editora": "Novo Conceito",
        "numeroPaginas": 252,
        "paisOrigem": "Brasil",
        "titulo": "P.S. Eu Te Amo",
        "status": 2,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 0,
        "dataCompra": "2019",
        "preco": "0,00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/ps_eu_te_amo?alt=media&token=7b5b75c9-70f2-4c9c-8fd9-1ca87dcf1433",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089160,
        "dataHoraAlteracao": 1601050089160,
        "id": 61
    },
    {
        "firebaseCodigo": "cCDBIZw62mC809rJfFqL",
        "anoEdicao": "2019",
        "autor": "Padre Reginaldo Manzotti",
        "descricao": "Há um Poder oculto dentro de você.Chegou a Hora de descobri- lo. Para Descobrir esse poder oculto é preciso passar por um treinamento especial— ou, se quisermos usar o termo do momento, por um coeching. Por sorte, temos nesta obra um guia, que, para além dos lugares- comuns que costumamos encontrar nos livros de autoajuda, conhece bem o caminho que devemos seguir. Nestas páginas, Pe.Reginaldo Manzotti nos conduz por um itinerário de profunda descoberta interior, cujo objetivo não pode ser outro senão o encontro com a verdadeira felicidade, isto é, com Deus e seus planos para nós. Você está preparado para este treinamento na fé, para encontrar a única alegria real?",
        "editora": "Petra",
        "numeroPaginas": 169,
        "paisOrigem": "Brasil",
        "titulo": "O Poder Oculto ",
        "status": 3,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/o_poder_oculto_?alt=media&token=fb63b07e-8611-47d2-93cd-f6a1f3fca169",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089160,
        "dataHoraAlteracao": 1601050089160,
        "id": 62
    },
    {
        "firebaseCodigo": "cuLr5NBf9WrDia9UumMQ",
        "anoEdicao": "2017",
        "autor": "Elizabeth Rudnick",
        "descricao": "Sentimentos são fáceis de mudar mesmo entre quem não vê que alguém pode ser seu par... Bela deseja para a sua vida muito mais do que a pequena cidade provinciana de Villeneuve pode oferecer. Lá ela se destaca da multidão com um ponto de vista único. uma independência vigorosa e um notável amor pelos livros. Ela anseia por viagens e aventuras, e por uma vida tão empolgante quanto as histórias que lê. mas, quando seu amado pai é aprisionado por uma fera em um castelo encantado, o destino de Bela muda para sempre. Ao arriscar sua liberdade e seu futuro. ela assume o lugar do pai. jurando -lhe que escaparia em segredo. No entanto, conforme aprende mais sobre a Fera e seu misterioso castelo. Bela descobre que pode haver mais sobre a história dele - e sobre a sua própria- do que ela jamais poderia ter imaginado.",
        "editora": "Universo dos Livros",
        "numeroPaginas": 240,
        "paisOrigem": "Brasil",
        "titulo": "A Bela e a Fera",
        "status": 2,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 0,
        "dataCompra": "2019",
        "preco": "0,00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/a_bela_e_a_fera?alt=media&token=9392d1cc-72d0-412e-aa61-e3fa461b041f",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089160,
        "dataHoraAlteracao": 1601050089160,
        "id": 63
    },
    {
        "firebaseCodigo": "cycl2b0EAAN4gV8G40rv",
        "anoEdicao": "2020",
        "autor": "Pe. Reginaldo Manzotti",
        "descricao": "Santo Casamenteiro ",
        "editora": "Petra",
        "numeroPaginas": 59,
        "paisOrigem": "Brasil",
        "titulo": "Santo Antônio",
        "status": 3,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/santo_antonio?alt=media&token=7832adeb-f62b-4f3b-9c63-bfc09f7078f0",
        "subtitulo": "Santo Antônio",
        "categoria": "Católico ",
        "dataHoraCriacao": 1601050089161,
        "dataHoraAlteracao": 1601050089161,
        "id": 64
    },
    {
        "firebaseCodigo": "didm6Ldmn4kDNJc1kjDm",
        "anoEdicao": "2019",
        "autor": "Sherlock Shomes",
        "descricao": "\"Não, eu nunca adivinho.É um péssimo hábito prejudicial às faculdades lógicas. (...) Por exemplo, comecei afirmando que seu irmão era descuidado. Observando a parte de baixo do relógio, nota- se que não só esta amassado em dois lugares, mas também está repleto de marcas e arranhões por guardá- lo no mesmo bolso que objetos duros. Não é grande façanha presumir que um homem que cuida de um relógio de cinquenta guinéus com tanto desmazelo seja negligente.\"",
        "editora": "Pandorga",
        "numeroPaginas": 135,
        "paisOrigem": "Brasil",
        "titulo": "O Signo dos Quatro",
        "status": 3,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/o_signo_dos_quatro?alt=media&token=c636dbde-2e68-48b2-998e-5fa9b7814870",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089161,
        "dataHoraAlteracao": 1601050089161,
        "id": 65
    },
    {
        "firebaseCodigo": "eGPf6ywn4DzF2Z8lyY4O",
        "anoEdicao": "2004",
        "autor": "Antônio Maria Claret",
        "descricao": "Tem você em suas mãos, ante seus olhos, a vida de um santo e por ele mesmo escrita, inspirada pelos seus sentimentos, publicada por uma quase intimação de seu amigo do peito, o Pe. José Xifre, primeiro superior geral dos missionários filhos do imaculado coração de maria( Claretiano). Tive a ousada vontade de traduzi -la em nossa língua, não para arquivos, estudos, bibliotecas, mas que fosse das livrarias para o povo simples ou erudito, visando primordialmente ao jovem, pois Claret é um santo da juventude, que muito escreveu para os jovens na idade e no espírito, sem os separar ou dissociar do povo, tão popular que foi.",
        "editora": "Ave Maria",
        "numeroPaginas": 208,
        "paisOrigem": "Brasil",
        "titulo": "Santo Antônio Claret por ele mesmo",
        "status": 3,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/santo_antonio_claret_por_ele_mesmo?alt=media&token=43625ac1-c443-4cb3-8bf7-7c2cd5e097f2",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089161,
        "dataHoraAlteracao": 1601050089161,
        "id": 8
    },
    {
        "firebaseCodigo": "egI6W2nwKJEsP2q143bc",
        "anoEdicao": "2013",
        "autor": "Robert Louis Stevenson",
        "descricao": "Jim Hawkins tem apenas doze anos, mas possui o espírito dos grandes heróis; sua saga é um marco da literatura infanto-juvenil. Quando o velho e beberrão marinheiro Billy hospeda-se na pensão de sua família, a vida de Jim ganha um novo curso, especialmente ao encontrar um enigmático mapa que indica um tesouro escondido. É quando Jim se envolve numa aventura que o levará à ilha onde supostamente o tesouro fora enterrado, enfrentando situações das mais inimagináveis, como Long John Silver, que consagrará o arquétipo popularmente conhecido de pirata. A ilha do tesouro apresenta os elementos da inventiva narrativa de Stevenson, que a qualifica como obra referencial do gênero de aventura, a qual transita suavemente entre o mundo real e o imaginário, tornando-a objeto de variadas releituras até os dias de hoje.",
        "editora": "Martin Claret",
        "numeroPaginas": 257,
        "paisOrigem": "Brasil",
        "titulo": "A Ilha do Tesouro",
        "status": 3,
        "isbn10": "8572329331",
        "isbn13": "9788572329330",
        "numeroEdicao": 2,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/a_ilha_do_tesouro?alt=media&token=da88bfd1-39b4-48a3-a751-86cf1452b66b",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089162,
        "dataHoraAlteracao": 1601050089162,
        "id": 66
    },
    {
        "firebaseCodigo": "ek0HFuZES7iBEUgiqgkJ",
        "anoEdicao": "2016",
        "autor": "J.K Rowling",
        "descricao": "Sempre foi difícil ser Harry Potter e não é mais fácil agora que ele é um sobrecarregado funcionário do Ministério da Magia, marido e pai de três crianças em idade escolar. Enquanto Harry lida com um passado que se recusa a ficar para trás, seu filho mais novo, Alvo, deve lutar com o peso de um legado de família que ele nunca quis. À medida que passado e presente se fundem de forma ameaçadora, ambos, pai e filho, aprendem uma incômoda verdade: às vezes as trevas vêm de lugares inesperados.",
        "editora": "Rocco",
        "numeroPaginas": 343,
        "paisOrigem": "Brasil",
        "titulo": "Harry Potter e a Criança Amaldiçoada, partes um e dois (Harry Potter, #8)",
        "status": 3,
        "isbn10": "8532530427",
        "isbn13": "9788532530424",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/harry_potter_e_a_crianca_amaldicoada__partes_um_e_dois__harry_potter__%238_?alt=media&token=aca49e70-e0e0-4df8-b408-910cc52d7677",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089162,
        "dataHoraAlteracao": 1601050089162,
        "id": 67
    },
    {
        "firebaseCodigo": "fR6PY2rGS4aAfcdVuUdV",
        "anoEdicao": "2015",
        "autor": "J.K Rowling",
        "descricao": "A luta contra Voldemort não vai nada bem. Hermione folheia as páginas do Profeta Diário e uma notícia é mais aterrorizante que a outra. Dumbledore tem se ausentado de Hogwarts por longos períodos. Ainda assim, a vida continua. Adolescentes namoram, brigam entre si e se apaixonam. As aulas estão cada vez mais difíceis e, em meio a tudo isso, Harry investiga a complexa história do jovem bruxo que se tornou Lorde Voldemort nos mínimos detalhes, na esperança de encontrar aquele que pode ser o único ponto fraco de seu arqui-inimigo.",
        "editora": "Rocco",
        "numeroPaginas": 471,
        "paisOrigem": "Brasil",
        "titulo": "Harry Potter e o Enigma do Príncipe (Harry Potter #6)",
        "status": 3,
        "isbn10": "8532530001",
        "isbn13": "9788532530004",
        "numeroEdicao": 1967,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/harry_potter_e_o_enigma_do_principe__harry_potter_%236_?alt=media&token=612d198b-8ac3-410e-bb6a-8dfbd6ad08ec",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089162,
        "dataHoraAlteracao": 1601050089162,
        "id": 68
    },
    {
        "firebaseCodigo": "fayB6tkr6nRMMqCwsorP",
        "anoEdicao": "2009",
        "autor": "Fúlvia M.L. Moretto",
        "descricao": "O romance dos romances, Madame Bovary apresenta- se aqui naquela que é considerada a melhor tradução em língua portuguesa, no brilhante trabalho de Fulvia Moretto, que também assina a introdução e as notas.Quando de sua publicação em folhetim, o livro provocou um impacto transformador na sociedade e literatura francesa. Ao tratar livremente o sexo e o adultério, o romance tocou profundamente a moral burguesa, que vislumbrou em sua obra- prima somente a ruína de todas as convenções. Seu padrão literário foi questionado, levando, inclusine, seu autor ao banco dos réus. A presente edição é também a única a apresentar os \" autos do processo\" movido contra Flaubert, e sua própria defesa, constituindo, igualmente, um documento literário da maior importância.",
        "editora": "Nova Alexandria",
        "numeroPaginas": 360,
        "paisOrigem": "Brasil",
        "titulo": "Madame Bovary",
        "status": 2,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 0,
        "dataCompra": "2019",
        "preco": "0,00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/madame_bovary?alt=media&token=4451ccd1-9d04-49ac-93b2-b77974d7248e",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089162,
        "dataHoraAlteracao": 1601050089162,
        "id": 69
    },
    {
        "firebaseCodigo": "fr1qXTC18amoHVNpzGru",
        "anoEdicao": "2016",
        "autor": "Nicholas Sparks",
        "descricao": "Filha de imigrantes mexicanos, Maria Sanchez é uma advogada inteligente, bonita e bem-sucedida que aprendeu cedo o valor do trabalho duro e de uma rotina regrada. Porém um trauma a faz questionar tudo em que acreditava e voltar para sua cidade natal, a pequena Wilmington. A cidade também é o lugar que Colin Hancock escolheu para se dar uma segunda chance. Apesar de jovem, ele sofreu mais violência e abandono do que a maioria das pessoas. Também cometeu sua parcela de erro e magoou mais gente do que gostaria. Agora está determinado a mudar de vida, tornar-se professor e dar às crianças o carinho e a atenção que ele próprio não teve. Colin e Maria não foram feitos um para o outro, mas um encontro casual durante uma tempestade mudará o rumo de suas histórias. Ao confrontar as diferenças entre os dois, eles questionarão as próprias convicções. E ao enxergar além das aparências, redescobrirão a capacidade de amar. Porém, nessa frágil busca por um recomeço, o relacionamento deles é ameaçado por uma série de incidentes suspeitos que reaviva antigos sofrimentos. E quando um perigo real começa a se impor, Colin e Maria precisam lutar para que o amor sobreviva. Com uma trama madura e repleta de emoções e de suspense, No seu olhar mostra que o amor às vezes é forjado em crises que ameaçam nos destruir e que o primeiro passo para a felicidade é acreditar em quem podemos ser.",
        "editora": "Arqueiro",
        "numeroPaginas": 432,
        "paisOrigem": "Brasil",
        "titulo": "No Seu Olhar",
        "status": 2,
        "isbn10": "0",
        "isbn13": "9788580415445",
        "numeroEdicao": 6,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/no_seu_olhar?alt=media&token=1bae0aef-0adb-440c-91bb-efd14c24cdb7",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089163,
        "dataHoraAlteracao": 1601050089163,
        "id": 70
    },
    {
        "firebaseCodigo": "ftb5OWi3njql32aM3yWg",
        "anoEdicao": "2016",
        "autor": "Jojo Moyes",
        "descricao": "Quando uma história termina, outra tem que começar.\n\nEm Depois de Você, sequência de Como eu era antes de você, Lou ainda não superou a perda de Will. Morando em um flat em Londres (Inglaterra), ela trabalha como garçonete em um pub no aeroporto. Certo dia, após beber muito, Lou cai do terraço. O terrível acidente a obriga voltar para a casa de sua família, mas também a permite conhecer Sam Fielding, um paramédico cujo trabalho é lidar com a vida e a morte, a única pessoa que parece capaz de compreendê-la.\n\nAo se recuperar, Lou sabe que precisa dar uma guinada na própria história e acaba entrando para um grupo de terapia de luto. Os membros compartilham sabedoria, risadas, frustrações e biscoitos horrorosos, além de a incentivarem a investir em Sam. Tudo parece começar a se encaixar, quando alguém do passado de Will surge e atrapalha os planos de Lou, levando-a a um futuro totalmente diferente. ",
        "editora": "Intrínseca",
        "numeroPaginas": 320,
        "paisOrigem": "Brasil",
        "titulo": "Depois de Você",
        "status": 2,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 0,
        "dataCompra": "2019",
        "preco": "0,00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/depois_de_voce?alt=media&token=4bc63a9e-e20d-472e-b95c-2879e81fd4bd",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089163,
        "dataHoraAlteracao": 1601050089163,
        "id": 71
    },
    {
        "firebaseCodigo": "fyslE1GWb1iZ9PcST0wn",
        "anoEdicao": "2019",
        "autor": "Jojo Moyes",
        "descricao": "Lou Clark Sabe Muitas Coisas... Sabe quantos quilômetros separam sua casa em Nova York e a casa do namorado, em Londres. Sabe que seu novo chefe é um homem bom, mas não imagina que a esposa dele guarda um importante segredo. Muito menos que sua vida está prestes a virar de novo de cabeça para baixo. Porque Lou vai conhecer Josh, e ele fará lembrar de outro homem que marcou sua vida.",
        "editora": "intrínseca",
        "numeroPaginas": 319,
        "paisOrigem": "Brasil",
        "titulo": "Ainda sou eu",
        "status": 2,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 0,
        "dataCompra": "2019",
        "preco": "0,00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/ainda_sou_eu?alt=media&token=0159545e-c53d-4238-bed7-d95a6973dc62",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089163,
        "dataHoraAlteracao": 1601050089163,
        "id": 72
    },
    {
        "firebaseCodigo": "g6jSPfEfVtGd10iLpACC",
        "anoEdicao": "2016",
        "autor": "Carroll, Lewis",
        "descricao": "Ao folhear cada página, esta edição especial do clássico infantil de Lewis Carroll vai dar asas à sua imaginação. Mergulhe nas aventuras de Alice pela toca do coelho e, com ela, conheça as mais estranhas e maravilhosas criaturas... Um coelho apressado, um chapeleiro pra lá de maluco, uma lagarta azul...",
        "editora": "Autêntica",
        "numeroPaginas": 240,
        "paisOrigem": "Brasil",
        "titulo": "Alice No País Das Maravilhas",
        "status": 2,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 0,
        "dataCompra": "2019",
        "preco": "0,00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/alice_no_pais_das_maravilhas?alt=media&token=220f9ce1-a93d-44e6-8ae1-6ad47d87d918",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089163,
        "dataHoraAlteracao": 1601050089163,
        "id": 73
    },
    {
        "firebaseCodigo": "grZEZYLWSvNQvsy434HC",
        "anoEdicao": "1943",
        "autor": "Antoine de Saint- Exupéry",
        "descricao": "Livro de criança? Com certeza. Livro de adulto também, pois todo homem traz dentro de si o menino que foi. Como explicar a adoção deste livro por povos tão variados, em tantos países de todos os continentes? Como explicar que ele seja lido sempre por tantos milhões e milhões de pessoas? Como explicar a atualidade deste livro traduzido em oitenta línguas diferentes?. Como compreender que uma história aparentemente tão ingênua seja comovente para tantas pessoas?. O pequeno príncipe devolve a cada um o mistério da infância. De repente retornam os sonhos. Reaparece a lembrança de questionamentos, desvelam- se incoerência acomodadas, quase já imperceptíveis na pressa do dia a dia. Voltam ao coração escondidas recordações. O reencontro, o homem- menino.",
        "editora": "AgirpP",
        "numeroPaginas": 93,
        "paisOrigem": "Brasil",
        "titulo": "O Pequeno Príncipe",
        "status": 2,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 0,
        "dataCompra": "2019",
        "preco": "0,00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/o_pequeno_principe?alt=media&token=dc9e2db5-bfb5-4aca-9160-035d0dec3f5d",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089164,
        "dataHoraAlteracao": 1601050089164,
        "id": 21
    },
    {
        "firebaseCodigo": "guPba5V5cXDXmqqv9hD2",
        "anoEdicao": "2016",
        "autor": "Nicholas Sparks",
        "descricao": "Traduzidos para 50 idiomas, os livros de Nicholas Sparks já venderam mais de 100 milhões de exemplares no mundo todo. “Sparks está em sua melhor forma nesta comovente história de amor sobre um herói imperfeito que tenta corrigir seus erros.” – Booklist Após quase 30 anos de casamento, Wilson Lewis é obrigado a encarar uma dolorosa verdade: sua esposa, Jane, parece ter deixado de amá-lo, e ele é o único culpado disso. Viciado em trabalho, Wilson costumava passar mais tempo no escritório do que com a família. Além disso, nunca conseguiu ser romântico como o sogro era com a própria mulher. A história de amor dos pais de Jane, contada em Diário de uma paixão, sempre foi um exemplo para os filhos de como um casamento deveria ser. Diante da incapacidade do marido de expressar suas emoções, Jane começa a duvidar de que tenha feito a escolha certa ao se casar com ele. Wilson, porém, sente que seu amor pela esposa só cresceu ao longo dos anos. Agora que seu relacionamento está ameaçado, ele vai fazer o que for necessário para se tornar o homem que Jane sempre desejou que ele fosse. Em O casamento, Nicholas Sparks faz os leitores relembrarem a alegria de se apaixonar e o desafio de se manterem apaixonados. **** “Desde Diário de uma paixão, os fãs aguardavam ansiosamente por uma sequência da história de amor de Allie e Noah Calhoun. Pois a espera acabou. Sparks narra sua doce história da forma adequada, sem exagerar nos sentimentos, e deixa uma reviravolta extraordinária para o final. As mulheres vão fechar o livro satisfeitas, suspirando e desejando ter um pouco do sincero e incrivelmente desejável Wilson nos próprios companheiros.” – Publishers Weekly “Uma aula emocionante sobre romance. – Daily Mirror “Nicholas Sparks escreve com uma profundidade de sentimento e uma ternura raramente vistas. Por vezes trouxe lágrimas de alegria e de tristeza aos meus olhos. Dolorosamente pungente.” – Peterborough Evening Telegraph “Gente comum, pessoas que têm uma história para contar e que o fazem através de suas relações, seus amores, sonhos, ilusões e falhas. É o material que o escritor Nicholas Sparks usa em O casamento.” – El País.",
        "editora": "Arqueiro",
        "numeroPaginas": 224,
        "paisOrigem": "Brasil",
        "titulo": "O Casamento",
        "status": 2,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/o_casamento?alt=media&token=ad5ea4fa-b6cb-4a62-9366-13acdf4d7516",
        "subtitulo": "",
        "categoria": "Romance",
        "dataHoraCriacao": 1601050089164,
        "dataHoraAlteracao": 1601050089164,
        "id": 74
    },
    {
        "firebaseCodigo": "hyUIDanbfUh9NTnJp74z",
        "anoEdicao": "2017",
        "autor": "J.K. Rowling",
        "descricao": "Animais Fantásticos & Onde Habitam, o clássico compêndio sobre criaturas mágicas de Next Scamander, deliciou gerações de leitores bruxos. Agora, nesta edição atualizada com um prefácio do próprio Next Scamander e a revelação de seis animais pouco conhecidos fora da comunidade de bruxos americana, os trouxas também têm a oportunidade de saber onde vive o pássaro- trovão, o que come o pufoso e por que os objetos brilhantes sempre devem ficar escondidos do prelúcio. A renda obtida com as vendas deste livro será revertida à Comic Relief, o que significa que o dinheiro que você pagar por ele realizará mágicas que superam os poderes de qualquer bruxo. Se você acha que isto não é razão suficiente para partilhar seu dinheiro, só podemos torcer para que, se um dia uma manticora atacá-lo, os bruxos que passarem e virem sejam mais caridosos e queiram ajudá-lo.",
        "editora": "Rocco",
        "numeroPaginas": 128,
        "paisOrigem": "Brasil",
        "titulo": "Animais Fantásticos & Onde Habitam",
        "status": 3,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/animais_fantasticos___onde_habitam?alt=media&token=9d4149f1-6233-4543-a5c2-95c3e6f4ca1c",
        "subtitulo": "",
        "categoria": "Fantasia",
        "dataHoraCriacao": 1601050089164,
        "dataHoraAlteracao": 1601050089164,
        "id": 75
    },
    {
        "firebaseCodigo": "kEiccflIVgtNmniwQRNR",
        "anoEdicao": "2001",
        "autor": "Stella Carr",
        "descricao": "Um roubo espetacular. Nenhum vidro quebrado, trancas e cadeados inviolados, silêncio absoluto na madrugada. Não era problema para Antony, Paul e Denis, companheiros de cela e de profissão. Nem mesmo a possibilidade de serem lesados pelo quarto homem, o mentor do roubo: bastou trocar, na cara dele, o estojo das pedras preciosas. Não contavam, porém, com pequenas adversidades: uma velhinha desmemoriada, um portão de ferro, um modo pouco convencional de exterminar ratos... Diante disso, por que temer a Scotland Yard?",
        "editora": "FTD",
        "numeroPaginas": 119,
        "paisOrigem": "Brasil",
        "titulo": "Os Criminosos vieram para o chá",
        "status": 2,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 187,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/os_criminosos_vieram_para_o_cha?alt=media&token=e1941b23-5bea-4c7a-bfa3-e2d071bf03cc",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089165,
        "dataHoraAlteracao": 1601050089165,
        "id": 76
    },
    {
        "firebaseCodigo": "kvOvzMAnpwVFhrihFwCc",
        "anoEdicao": "2011",
        "autor": "Anderson Cavalcante",
        "descricao": "Acredite em milagres.",
        "editora": "Sextante",
        "numeroPaginas": 76,
        "paisOrigem": "Brasil",
        "titulo": "Você acredita em milagres?",
        "status": 2,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/voce_acredita_em_milagres_?alt=media&token=6dd534ff-f010-4299-bfda-451e8094e33e",
        "subtitulo": "Autor de O que realmente importa?",
        "categoria": "Auto estima",
        "dataHoraCriacao": 1601050089165,
        "dataHoraAlteracao": 1601050089165,
        "id": 77
    },
    {
        "firebaseCodigo": "l5S2cboOJbJV8o7eAQQh",
        "anoEdicao": "2017",
        "autor": "Nicholas Sparks",
        "descricao": "Com uma carreira bem-sucedida, uma linda esposa e uma adorável filha de 6 anos, Russell Green tem uma vida de dar inveja. Ele está tão certo de que essa paz reinará para sempre que não percebe quando a situação começa a sair dos trilhos.Em questão de meses, Russ perde o emprego e a confiança da esposa, que se afasta dele e se vê obrigada a voltar a trabalhar. Precisando lutar para se adaptar a uma nova realidade, ele se desdobra para cuidar da filhinha, London, e começa a reinventar a vida profissional e afetiva – e a se abrir para antigas e novas emoções.Lançando-se nesse universo desconhecido, Russ embarca com London numa jornada ao mesmo tempo assustadora e gratificante, que testará suas habilidades e seu equilíbrio emocional além do que ele poderia ter imaginado.Em Dois a dois, Nicholas Sparks conta a história de um homem que precisa se redescobrir e buscar qualidades que nem desconfiava possuir para lutar pelo que é mais importante na vida: aqueles que amamos.",
        "editora": "Arqueiro",
        "numeroPaginas": 501,
        "paisOrigem": "Brasil",
        "titulo": "Dois a dois",
        "status": 3,
        "isbn10": "8580417015",
        "isbn13": "9788580417012",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/dois_a_dois?alt=media&token=b0e3765c-c4b5-4c54-8119-d223193605b4",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089166,
        "dataHoraAlteracao": 1601050089166,
        "id": 78
    },
    {
        "firebaseCodigo": "lQbeejYxzTxjx7ExIkHe",
        "anoEdicao": "1978",
        "autor": "Pe. Reus",
        "descricao": "Todos nós sabemos como se tornou séria e ameaçadora a situação atual. O medo, a insegurança e a convicção de não nos podermos valer a nós mesmos nem encontrar solução para os nossos problemas que crescem dia a dia. A MÃE DE DEUS quer salvar- nos dessa situação tremenda e sem saída com os nossos recursos meramente humanos, oferecendo- nos um presente precioso, novo e singular: Recebemos com coração grato e aberto o presente singular que a nossa Mãe deles de nos oferece.Nas páginas, que se seguem, reproduzimos excertos das mensagens de Maria concernentes à CHAMA DO AMOR do Seu Coração Imaculado....Mãe de Deus, derramai sobre a humanidade inteira as graças eficazes da Vossa Chama de Amor, agora e na hora de nossa morte. Amém.",
        "editora": "Livro da Família",
        "numeroPaginas": 16,
        "paisOrigem": "Brasil",
        "titulo": "Chama de Amor do Imaculado Coração de Maria",
        "status": 2,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/chama_de_amor_do_imaculado_coracao_de_maria?alt=media&token=8e5d7b41-0e1c-48ca-a3da-deb1e2e23ca0",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089166,
        "dataHoraAlteracao": 1601050089166,
        "id": 79
    },
    {
        "firebaseCodigo": "ltH24AAB9IgvgjcuWyFV",
        "anoEdicao": "2013",
        "autor": "Padre Lourenço Ferronatte",
        "descricao": "O Livro contém a História de Nossa Senhora do Carmo do Monte Carmelo...E também contém a História de São Simão Stock e tem a novena de Nossa Senhora do Carmo..",
        "editora": "Associação Católica Nossa Senhora de Fátima",
        "numeroPaginas": 32,
        "paisOrigem": "Brasil",
        "titulo": "Nossa Senhora do Carmo",
        "status": 3,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/nossa_senhora_do_carmo?alt=media&token=51d1aaea-8404-47a5-884f-5cd907aad076",
        "subtitulo": "Coleção Tesouro Marianos",
        "categoria": "Católico",
        "dataHoraCriacao": 1601050089166,
        "dataHoraAlteracao": 1601050089166,
        "id": 80
    },
    {
        "firebaseCodigo": "n3QM1BMcjtXcDSGnHGy6",
        "anoEdicao": "2018",
        "autor": "Domenico Agasso Jr",
        "descricao": "Amar Jesus com todo o coração, com toda a alma,e inteiramente com todo o seu ser, sem reservar nada para si. Único desejo, seguir de perto Jesus, como os Apóstolos!.",
        "editora": "Effata",
        "numeroPaginas": 159,
        "paisOrigem": "Brasil",
        "titulo": "Amor que não se deixa vencer",
        "status": 2,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/amor_que_nao_se_deixa_vencer?alt=media&token=f19962c2-a6ae-47a5-8926-098c56862d95",
        "subtitulo": "Madre Clelia Merloni",
        "categoria": "Católico",
        "dataHoraCriacao": 1601050089166,
        "dataHoraAlteracao": 1601050089166,
        "id": 81
    },
    {
        "firebaseCodigo": "n46vATOWKNruURUG7tmU",
        "anoEdicao": "2004",
        "autor": "Pe. Luís Maria Alves Correia",
        "descricao": "\" A flor que vai contar a sua história alegra- se de ter que publicar os favores inteiramente gratuitos que recebeu de Jesus, reconhecendo que nada havia nela que fosse capaz de atrair os divinos olhares  e que tudo quanto recebeu foi fruto exclusivo da misericórdia daquele Deus que a fez nascer num terreno sagrado; daquele Deus que, por um extremo de amor, a quis preservar do bafo pestilento do mundo e trans transplantá- la à montanha do Carmelo, ao jardim predileto da Virgem Maria\".",
        "editora": "Minha biblioteca Católica",
        "numeroPaginas": 353,
        "paisOrigem": "Brasil",
        "titulo": "História de Uma Alma",
        "status": 2,
        "isbn10": "8809033868",
        "isbn13": "9788809033863",
        "numeroEdicao": 362,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/historia_de_uma_alma?alt=media&token=b99650eb-9dcc-443c-815e-9aa67829c0b3",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089167,
        "dataHoraAlteracao": 1601050089167,
        "id": 82
    },
    {
        "firebaseCodigo": "nA6tvteqwC2xpugfyDvJ",
        "anoEdicao": "2015",
        "autor": "J.K Rowling",
        "descricao": "Neste 4° volume das aventuras de Harry Potter, nosso herói, cansado das férias de verão, não vê a hora de começar o ano letivo. Já é o quarto ano na Escola de Feitiçaria e Bruxaria Hogwarts. Claro, há muitos novos feitiços, poções para serem experimentadas e aulas de adivinhação. Harry Potter está ansioso pelos novos aprendizados. Entretanto, acontecimentos inesperados já estão a caminho...",
        "editora": "Rocco",
        "numeroPaginas": 535,
        "paisOrigem": "Brasil",
        "titulo": "Harry Potter e o Cálice de Fogo (Harry Potter #4)",
        "status": 3,
        "isbn10": "8532529984",
        "isbn13": "9788532529985",
        "numeroEdicao": 6,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/harry_potter_e_o_calice_de_fogo__harry_potter_%234_?alt=media&token=4844f513-ca61-4d9b-b810-dcb0b97f87b6",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089167,
        "dataHoraAlteracao": 1601050089167,
        "id": 83
    },
    {
        "firebaseCodigo": "o0eJ2kYkb9QCcxPs25Gt",
        "anoEdicao": "2001",
        "autor": "Padre José",
        "descricao": "Nos fala sobre o caminho do pai, sobre o céu..",
        "editora": "não tem ",
        "numeroPaginas": 15,
        "paisOrigem": "Brasil",
        "titulo": "A Caminho do Pai",
        "status": 3,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/a_caminho_do_pai?alt=media&token=0c83e21e-ef43-40eb-a1a5-80f9b46a8428",
        "subtitulo": "O Purgatório",
        "categoria": "Católico",
        "dataHoraCriacao": 1601050089167,
        "dataHoraAlteracao": 1601050089167,
        "id": 105
    },
    {
        "firebaseCodigo": "oDfOrUOY0A5wPpTBpYFF",
        "anoEdicao": "2015",
        "autor": "J.K Rowling",
        "descricao": "Há uma porta ao final do silencioso corredor. E ela anda assombrando os sonhos de Harry Potter. Como se não bastasse ter de lidar com os exames que se aproximam; a nova professora que mais parece uma Megera, o elfo doméstico que só sabe reclamar; e a crescente ameaça d’Aquele-Que-Não-Pode-Ser-Nomeado. Agora Harry Potter se vê refém dos próprios líderes do mundo bruxo, nos quais ele não pode confiar, e da fragilidade das autoridades de Hogwarts. Apesar de tudo isso, ele encontra ajuda e força em seus amigos. Uma lealdade sem limites e a coragem para o que for preciso; até mesmo o mais brutal dos sacrifícios.",
        "editora": "Rocco",
        "numeroPaginas": 703,
        "paisOrigem": "Brasil",
        "titulo": "Harry Potter e a Ordem da Fênix",
        "status": 3,
        "isbn10": "8532529992",
        "isbn13": "9788532529992",
        "numeroEdicao": 2003,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/harry_potter_e_a_ordem_da_fenix?alt=media&token=e361ec24-d546-4600-981e-407e19ed5bfe",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089167,
        "dataHoraAlteracao": 1601050089167,
        "id": 84
    },
    {
        "firebaseCodigo": "odrEfQOowajPmPbSQ1jo",
        "anoEdicao": "2015",
        "autor": "Kazu Kibuishi",
        "descricao": "Durante 12 longos anos, a assustadora fortaleza de Azkaban manteve prisioneiro o bruxo Sirius Black. Condenado pelo assassinato de 13 pessoas com um só feitiço, alguns acreditam que Black seja o mais fiel dos seguidores daquele que não deve ser nomeado. Agora ele fugiu da prisão. E os guardas da prisão disseram que Black andara repetindo a seguinte frase durante o sono \"Ele está em Hogwarts... ele está em Hogwarts.\" Será que o perigoso bruxo esta vindo atras de Harry.Seja como for, Harry não está seguro, nem mesmo dentro de sua escola de magia, cercado por seus amigos. Principalmente porque, para piorar as coisas, pode haver um traidor entre as pessoas que o cercam.",
        "editora": "Rocco",
        "numeroPaginas": 318,
        "paisOrigem": "Brasil",
        "titulo": "Harry Potter e o Prisioneiro de Azkaban (Harry Potter #3)",
        "status": 2,
        "isbn10": "8532529976",
        "isbn13": "9788532529978",
        "numeroEdicao": 285,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/harry_potter_e_o_prisioneiro_de_azkaban__harry_potter_%233_?alt=media&token=990a5c2e-f500-4725-8d34-8f6d59f26821",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089168,
        "dataHoraAlteracao": 1601050089168,
        "id": 85
    },
    {
        "firebaseCodigo": "okGrs28E39udFkv2ymT5",
        "anoEdicao": "2015",
        "autor": "J.K Rowling",
        "descricao": "A vida do menino Harry Potter não tem um pingo de magia. Ele vive com os tios e o primo, que não gostam nem um pouco dele. O quarto de Harry é, na verdade, um armário sob a escada, e ele nunca comemorou um aniversário sequer em onze anos.Até que, um dia, Harry recebe uma carta misteriosa, entregue por uma coruja: uma carta com um convite para estudar num lugar incrível chamado Escola de Magia e Bruxaria Hogwarts. Lá ele vai encontrar não só amigos, esportes praticados em vassouras voadoras e magia para todo lado, como também seu destino..Os sete livros da saga do bruxo mais querido do mundo agora reunidos num box exclusivo e em nova edição, com projeto gráfico de Kazu Kibuishi em que as lombadas alinhadas formam o castelo de Hogwarts, ilustrações de abertura de capítulo por Mary GrandPré e miolo em papel pólen.",
        "editora": "Rocco",
        "numeroPaginas": 223,
        "paisOrigem": "Brasil",
        "titulo": "Harry Potter e a Pedra Filosofal",
        "status": 2,
        "isbn10": "853252995X",
        "isbn13": "9788532529954",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/harry_potter_e_a_pedra_filosofal?alt=media&token=988a2a12-d0e8-4779-b0c1-54baa5cd3c5a",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089168,
        "dataHoraAlteracao": 1601050089168,
        "id": 86
    },
    {
        "firebaseCodigo": "pJeq858gVeFik9xVbTI1",
        "anoEdicao": "2017",
        "autor": "Madeleine L' engle",
        "descricao": "Um Clássico da Fantasia e da Ficção Científica Emerge!. Era uma noite escura e tempestuosa; a jovem Meg Murry e seu irmão mais novo, Charles Wallace, descem para fazer um lanche tardio quando recebem a visita de uma figura muito peculiar. \" Noites loucas são a minha glória\", diz a estranha misteriosa. \"Foi só uma lufada que me pegou de jeito e me tirou da rota. Descansei um pouco e seguirei meu rumo. Por falar em rumos, meu doce, saiba que o tesserato existe, sim.\" O que seria um tesserato? O pai de Meg bem andava experimentando com a quinta dimensão quando desapareceu misteriosamente...Agora com a ajuda de três criaturas muito peculiares, chegou o momento de Meg, seu amigo Calvin e seu irmão Charles Wallace partirem em uma jornada para resgatá-lo. Uma jornada perigosa pelo tempo e o espaço. Uma dobra no tempo é uma aventura clássica, que serviu de inspiração para os mestres da fantasia e da ficção científica do mundo, agora adaptada para os cinemas pela Disney. Junte- se à família Murry nesta jornada, entre criaturas fantásticas e novos mundos jamais imaginados.",
        "editora": "Harper Collins",
        "numeroPaginas": 237,
        "paisOrigem": "Brasil",
        "titulo": "Uma Dobra no Tempo",
        "status": 3,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 0,
        "dataCompra": "2019",
        "preco": "0,00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/uma_dobra_no_tempo?alt=media&token=0dba745b-f7a0-41f7-bebd-ddce9299ff84",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089168,
        "dataHoraAlteracao": 1601050089168,
        "id": 87
    },
    {
        "firebaseCodigo": "psFufVajA3Q35dB2KIvK",
        "anoEdicao": "2018",
        "autor": "Padre Reginaldo Manzotti",
        "descricao": "Combate espiritualmente...",
        "editora": "Petra",
        "numeroPaginas": 199,
        "paisOrigem": "Brasil",
        "titulo": "Combate Espiritual",
        "status": 3,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/combate_espiritual?alt=media&token=42aae5f6-edb5-4462-a8ad-3d856a623ab1",
        "subtitulo": "Combate Espiritual",
        "categoria": "Católico",
        "dataHoraCriacao": 1601050089168,
        "dataHoraAlteracao": 1601050089168,
        "id": 88
    },
    {
        "firebaseCodigo": "pvAe13d2ie39oFWt5Ajb",
        "anoEdicao": "2019",
        "autor": "São Luis Maria Grignion de Montfort",
        "descricao": "\"Se rezardes o Rosário fielmente, até a morte, asseguro- vos que, a despeito da gravidade de vossos pecados, recebereis uma incorruptível coroa de glória. Mesmo se estiverdes à beira da condenação, ainda que tenhais um pé já no inferno, ainda que tenhais vendido a alma ao Diabo, como os feiticeiros que praticam magia negra, e ainda que sejais um herege tão obstinado quanto um demônio, cedo ou tarde sereis convertido, emendareis vossa vida é salvareis vossa alma, se — e se escutai bem o que digo— rezardes o Rosário, devotamente, todos os dias, até a morte, com a intenção de conhecer a verdade e obter a contrição e perdão de vossos pecados. Neste livro, há várias histórias de grandes pecadores que foram convertidos pelo poder do Rosário. Ponde- vos a ler e meditar sobre todas.\"",
        "editora": "Minha Biblioteca Católica",
        "numeroPaginas": 286,
        "paisOrigem": "Brasil",
        "titulo": "O Segredo Admirável do Santíssimo Rosário",
        "status": 3,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/o_segredo_admiravel_do_santissimo_rosario?alt=media&token=692245d2-d119-4d6f-84cb-24dad4c134cd",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089169,
        "dataHoraAlteracao": 1601050089169,
        "id": 89
    },
    {
        "firebaseCodigo": "q9OSxYJetzHfd3VKhaYI",
        "anoEdicao": "2015",
        "autor": "Stephenie Meyer",
        "descricao": "Novamente, os leitores vão se apaixonar pela arrebatadora história de amor de Bella e Edward... ou, quem sabe, será uma primeira vez. A edição especial de aniversário inclui um conteúdo extra e exclusivo: Vida e morte, nova versão em que a autora inverte o gênero dos principais personagens. Em Vida e morte os leitores vão se maravilhar com a experiência de ler a icônica saga de amor agora pelos olhos de um adolescente que se apaixona por uma sedutora vampira. Numa publicação ao estilo vira-vira, a edição comemorativa traz mais de 400 páginas de conteúdo extra, além da nova capa, com Crepúsculo de um lado e Vida e morte de outro. Os milhares de fãs de Bella e Edward não vão querer perder a oportunidade de ver seus tão queridos personagens em novos papéis. Fico maravilhada que já se tenham passado 10 anos da primeira edição de Crepúsculo, comenta a autora Stephenie Meyer. 'Para mim, esse aniversário é uma comemoração dos fãs, que sempre foram inacreditavelmente dedicados e apaixonados.'",
        "editora": "Intrínseca",
        "numeroPaginas": 736,
        "paisOrigem": "Brasil",
        "titulo": "Crepúsculo - Edição Especial de Aniversário de 10 Anos",
        "status": 2,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 0,
        "dataCompra": "2019",
        "preco": "0,00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/crepusculo___edicao_especial_de_aniversario_de_10_anos?alt=media&token=168371e4-87d8-4f43-9d45-d20a9863cdc6",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089169,
        "dataHoraAlteracao": 1601050089169,
        "id": 90
    },
    {
        "firebaseCodigo": "qQmawAnTzQqWxeLC2iwd",
        "anoEdicao": "2006",
        "autor": "Iara Rosa da Silva",
        "descricao": "Conta História de Nossa Senhora das Graças....",
        "editora": "Canção Nova ",
        "numeroPaginas": 76,
        "paisOrigem": "Brasil",
        "titulo": "Devocionário de Nossa Senhora das Graças",
        "status": 3,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/devocionario_de_nossa_senhora_das_gracas?alt=media&token=6e3a9eec-7c05-468f-84d6-f33ae8d6dadb",
        "subtitulo": "Nossa Senhora da Medalha Milagrosa",
        "categoria": "Católico",
        "dataHoraCriacao": 1601050089169,
        "dataHoraAlteracao": 1601050089169,
        "id": 106
    },
    {
        "firebaseCodigo": "r6YmhaAf5Q13Gov6J0TH",
        "anoEdicao": "2015",
        "autor": "Stephenie Meyer",
        "descricao": "Parecia que eu estava presa em um daqueles pesadelos apavorantes em que você precisa correr, correr até os pulmões explodirem, mas não consegue fazer com que seu corpo se mexa com rapidez suficiente.(...)Mais isso não era um sonho, e, ao contrário do pesadelo, eu não estava correndo para salvar a minha vida; eu corria para salvar algo infinitamente mais precioso. Hoje minha própria vida pouco significava para mim.  Para Bella Swan, Há uma coisa mais importante do que a própria vida: Edward Cullen. Mas estar apaixonada por um vampiro é ainda mais perigoso do que ela poderia ter imaginado. Edward já resgatara Bella das garras de um monstro cruel, mas agora, quando o relacionamento ousado do casal ameaça tudo o que lhes é próximo e querido, eles percebem que seus problemas podem estar apenas começando...Legiões de Leitores que Ficaram em transe com o best- seller Crepúsculo estão ávidos pela sequência da história de amor de Bella e Edward. Em Lua Nova, Sthephenie Meyer nos dá outra combinação irresistível de romance e suspense com um toque sobrenatural. Apaixonante e cheia de reviravolta surpreendentes, essa saga de amor e vampiros segue rumo à imortalidade literária.",
        "editora": "Intrinseca",
        "numeroPaginas": 401,
        "paisOrigem": "Brasil",
        "titulo": "Lua Nova",
        "status": 2,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 0,
        "dataCompra": "2019",
        "preco": "0,00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/lua_nova?alt=media&token=07e68050-94bd-40da-a705-9df97ea17c4e",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089169,
        "dataHoraAlteracao": 1601050089169,
        "id": 91
    },
    {
        "firebaseCodigo": "rLdTgrapvlXhkUBEVJQS",
        "anoEdicao": "2018",
        "autor": "Luzia Santiago",
        "descricao": "Pequenas reflexões e orações de auto estima para que tenha um belíssimo dia.",
        "editora": "Canção Nova",
        "numeroPaginas": 185,
        "paisOrigem": "Brasil",
        "titulo": "Comece bem o seu dia",
        "status": 3,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 0,
        "dataCompra": "2019",
        "preco": "0,00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/comece_bem_o_seu_dia?alt=media&token=cb098fa8-a842-4235-ad60-4af93a6aaa78",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089170,
        "dataHoraAlteracao": 1601050089170,
        "id": 92
    },
    {
        "firebaseCodigo": "tvdIHsTFhrNUKyGfykJf",
        "anoEdicao": "2017",
        "autor": "Nicholas Sparks",
        "descricao": " “Quando me sentei para planejar a história de Noah e Allie, muitos anos atrás, nunca imaginei aonde minha própria jornada me levaria. Embora tenha gostado de escrever todos os meus livros, sempre terei um carinho especial por Diário de uma paixão  – Nicholas Sparks. Duke é um homem simples com uma vida modesta, mas amou alguém de todo o coração e, para ele, isso sempre foi suficiente. Na clínica de repouso em que vive, Duke se dedica a ler poemas para os outros pacientes, mas, para uma senhora que sofre de Alzheimer – e somente para ela –, lê um diário especial à espera de que um milagre aconteça. Nele está escrita a emocionante história de Allie Nelson e Noah Calhoun, dois jovens que descobrem o verdadeiro significado da paixão, mas são separados por uma série de obstáculos e mal-entendidos.Muitos anos depois, a vida dá conta de uni-los novamente e a paixão volta com todo o seu fulgor. Já noiva de um bem-sucedido advogado, Allie precisa optar entre manter o rumo estável de sua vida e se entregar ao verdadeiro amor, correndo todos os riscos.Com a leitura do diário, Duke recorda a própria vida e, às vezes, a senhora consegue romper as barreiras da doença e retomar sua antiga identidade alegre e vivaz. E, sempre que isso acontece, Duke tem a certeza de que o amor relatado nas páginas do diário é a força mais poderosa do Universo. Diário de uma paixão  foi o primeiro romance publicado por Nicholas Sparks e é uma prova do talento que o consagrou por todo o mundo. Entremeando as histórias de Allie, Noah e Duke, ele construiu um conto romântico que se tornou um verdadeiro clássico.",
        "editora": "Arqueiro",
        "numeroPaginas": 172,
        "paisOrigem": "Brasil",
        "titulo": "Diário de Uma Paixão. O Amor É a Força Mais Poderosa do Universo",
        "status": 2,
        "isbn10": "8580416701",
        "isbn13": "9788580416701",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/diario_de_uma_paixao_o_amor_e_a_forca_mais_poderosa_do_universo?alt=media&token=8e5aeb15-91e6-4ddc-88a9-f33327342034",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089170,
        "dataHoraAlteracao": 1601050089170,
        "id": 93
    },
    {
        "firebaseCodigo": "u9yxHxnIKBxOaBNZoNai",
        "anoEdicao": "2012",
        "autor": "Santo Afonso de Ligorio",
        "descricao": "Vários e fortes motivos levaram Santo Afonso a escrever \" Glórias de Maria\". Em primeiro lugar, sua devoção à Virgem Maria, a quem aprendera a amar desde a infância. Sentia- se também obrigado pela gratidão, pois atribuía a Maria a sua \" conversão\", e queria colocar à disposição dos pregadores uma obra bem documentada que os ajudassem a instruir os fiéis. Finalmente, sentia- se na obrigação de combater as ideias de tantos que se opunham à piedade popular para com a Mãe de Deus. Queria escrever um livro de piedade que fosse atraente, sedutor, mas que também estivesse baseado num sólida teologia. O livro nasceu aos poucos, cuidadosamente estruturado, escrito ao mesmo tempo com a mente e com o coração. Numa primeira parte foi apresentado um comentário sobre a \" Salve, Rainha\". Na segunda, escreveu sobre as principais festas de Maria, suas dores, suas virtudes e também sobre as principais práticas de devoção para com ela. É um livro tecido quase como uma grinalda, onde as reflexões do autor se entrelaçam com as passagens mais belas da Sagrada Escritura, dos santos e dos teólogos. Um livro em que as reflexões se transformam em orações. Um livro que fala uma linguagem acessível ao povo, usando as comparações e os exemplos vividos que tornaram a doutrina bem concreta. Santo Afonso levou quase quinze anos para escrever para a sua Rainha um livro simples e belo. Levou quase quinze anos para finalmente escrever na primeira página dos originais com um floreiro: \"GLÓRIAS DE MARIA\".",
        "editora": "Santuário",
        "numeroPaginas": 504,
        "paisOrigem": "Brasil",
        "titulo": "Glórias de Maria",
        "status": 3,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/glorias_de_maria?alt=media&token=e6ee8f78-3404-408b-8118-abb17ae5d0c0",
        "subtitulo": "Glórias de Maria ",
        "categoria": "Católico",
        "dataHoraCriacao": 1601050089170,
        "dataHoraAlteracao": 1601050089170,
        "id": 94
    },
    {
        "firebaseCodigo": "uUn43k8eZChzlWaJGsFy",
        "anoEdicao": "2017",
        "autor": "Pedro Siqueira",
        "descricao": "Aonde quer que eu vá dirigir grupos de oração, os fiéis me perguntam se têm um anjo protetor. Minha resposta é sempre a mesma; todo mundo tem um anjo da guarda! Desde a concepção, Deus designa a todos um ser angélico para acompanhá- los em sua jornada neste mundo. OS ANJOS DA GUARDA são presentes de Deus para todas as pessoas, sem exceção. Essa é a verdade que Pedro Siqueira quer transmitir para no. Muitas vezes esquecidos, ignorados ou até desacreditados, nossos protetores ainda são um mistério para a maioria dos fiéis. Em seu novo livro, Pedro abre esse universo aos leitores. Partindo de uma visão geral das criaturas celestes, ele explica que é possível ver nossos anjos da guarda e até saber seus nomes. Além disso, mostra como podemos nos comunicar com eles para estreitar os laços com Deus. Dirigindo terços para milhares de fiéis, com visões espirituais intensas, Pedro tem uma extensa bagagem de experiências próprias e relatos que lhe dão embasamento suficiente para tratar de um assunto frequentemente insondável. Por meio de diversos casos, Todo Mundo tem um anjo da guarda tira as principais dúvidas sobre o tema e oferece um conhecimento fundamental para quem almeja uma vida espiritual mais profunda.",
        "editora": "Sextante",
        "numeroPaginas": 95,
        "paisOrigem": "Brasil",
        "titulo": "Todo Mundo Tem Um Anjo Da Guarda ",
        "status": 2,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 0,
        "dataCompra": "2019",
        "preco": "0,00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/todo_mundo_tem_um_anjo_da_guarda_?alt=media&token=93b74a79-11c4-4be2-92ff-c26990121454",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089170,
        "dataHoraAlteracao": 1601050089170,
        "id": 95
    },
    {
        "firebaseCodigo": "v1GhwueBcHjkMK5RmIUK",
        "anoEdicao": "2017",
        "autor": "Pe. Reginaldo Manzotti",
        "descricao": "Por acaso você é alguém que só acredita no que vê? Caso seja, saiba que já está em desvantagem na grande batalha que vem sendo travada desde os primórdios da humanidade: A batalha entre o bem e o mal, isto é, entre os que se encontram do lado de Deus e o Inimigo, que deseja desvirtuar todos os homens e mulheres de boa vontade para fazê- los viver uma vida fundada na mentira, no erro e no desregramento. Neste livro, Pe. Reginaldo Manzotti desfaz todos os mitos que rodeiam esse combate crucial, revelando-nos, com detalhes, tanto na natureza do adversário quanto as armas humanas e sobrenaturais de que podemos nos valer para assegurarmos a vitória que nos foi conquistada pelo sangue de Jesus Cristo. Com este guia em mãos, nada precisaremos temer. Jamais.                                        ",
        "editora": "Petra ",
        "numeroPaginas": 173,
        "paisOrigem": "Brasil",
        "titulo": "Batalha Espiritual",
        "status": 3,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 0,
        "dataCompra": "2019",
        "preco": "0,00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/batalha_espiritual?alt=media&token=0241bc37-147a-4151-93df-75d83c4c6bdc",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089171,
        "dataHoraAlteracao": 1601050089171,
        "id": 96
    },
    {
        "firebaseCodigo": "vQvZbjcHmZHnihENByMO",
        "anoEdicao": "2020",
        "autor": "Santo Afonso de Ligório",
        "descricao": "O grande meio para alcançarmos de Deus a salvação e todas as graças que desejamos.",
        "editora": "Santuário",
        "numeroPaginas": 109,
        "paisOrigem": "Brasil",
        "titulo": "A Oração",
        "status": 3,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/a_oracao?alt=media&token=3e5c3b64-d9ff-4d36-9797-4fd703e73e0b",
        "subtitulo": "",
        "categoria": "Católico",
        "dataHoraCriacao": 1601050089171,
        "dataHoraAlteracao": 1601050089171,
        "id": 103
    },
    {
        "firebaseCodigo": "w9uIdhL5sC3HMRL95fAf",
        "anoEdicao": "2014",
        "autor": "Padre Germano de Santo Estanislau",
        "descricao": "O Livro conta sobre a sua vida..",
        "editora": "Ecclesiae",
        "numeroPaginas": 342,
        "paisOrigem": "Brasil",
        "titulo": "Santa Gema Galgani",
        "status": 3,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/santa_gema_galgani?alt=media&token=2583fd49-f480-4634-b2c5-89c976a903ce",
        "subtitulo": "",
        "categoria": "Católico",
        "dataHoraCriacao": 1601050089171,
        "dataHoraAlteracao": 1601050089171,
        "id": 104
    },
    {
        "firebaseCodigo": "xO6XDn4gq96onsAGUq5Q",
        "anoEdicao": "2013",
        "autor": "Padre Lourenço",
        "descricao": "Conta a História de Nossa Senhora de Guadalupe ",
        "editora": "Associação Nossa Senhora de Fátima",
        "numeroPaginas": 34,
        "paisOrigem": "Brasil",
        "titulo": "Nossa Senhora de Guadalupe",
        "status": 3,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/nossa_senhora_de_guadalupe?alt=media&token=9df115bf-003a-4eee-a803-271fc2939eec",
        "subtitulo": "Coleção Tesouros Marianos",
        "categoria": "Católico",
        "dataHoraCriacao": 1601050089171,
        "dataHoraAlteracao": 1601050089171,
        "id": 109
    },
    {
        "firebaseCodigo": "yGgl7aZwIGZyWfRJ1jCy",
        "anoEdicao": "2015",
        "autor": "Padre Reginaldo Manzotti",
        "descricao": "Neste livro da Trilogia Sinais do Sagrado, Padre Reginaldo Manzotti, um estudioso dos textos bíblicos, nos faz um convite irresistível: voltar à escola tendo como professor o próprio Jesus. Por meio de Suas parábolas riquíssimas em significado, Ele nos ensina inestimáveis valores e verdades espirituais. Este livro apresenta à mensagem de cada uma das parábolas aqui compiladas segundo o contexto atual. Isso possibilita a compreensão do seu sentido mais profundo e a identificação de virtudes que nos ajudam  a refletir sobre o que é ser cristão e como alcançar o verdadeiro crescimento espiritual. Presentes na humanidade há pelo menos dois milênios, histórias contadas por Jesus não são ultrapassadas; pelo contrário, estão cada vez mais atuais. Conduzidos pelo olhar atento do Padre Reginaldo, aprendemos o quanto elas podem ser transformadoras para nós e para o mundo à nossa volta, proporcionando as mudanças necessárias para uma vida melhor e mais próxima de Deus. Não se atrase, a aula já vai começar...",
        "editora": "Petra",
        "numeroPaginas": 173,
        "paisOrigem": "Brasil",
        "titulo": "Parábolas",
        "status": 3,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/parabolas?alt=media&token=8111316b-0ec0-4d99-857d-66c30d4758e7",
        "subtitulo": "Sinais do Sagrado",
        "categoria": "Católico",
        "dataHoraCriacao": 1601050089172,
        "dataHoraAlteracao": 1601050089172,
        "id": 97
    },
    {
        "firebaseCodigo": "yNzLmdKCAwZeskL4hyT8",
        "anoEdicao": "2010",
        "autor": "São Pio X",
        "descricao": "O Espírito humano é de tal feito que, com grande esforço e diligência, consegue investigar por si mesmo, e chegar ao conhecimento de certas verdades relativa a Deus. Nunca, porém, poderia conhecer e distinguir, só com a luz natural, a maior parte das verdades que nos levam à eterna salvação, para o qual o homem foi primordialmente criado e formado à imagem e semelhança de Deus. Mas, \" esse mistério que se conservou oculto de todos os séculos e gerações\", excede tanto a inteligência humana que, \"se não fora revelado aos santos a quem Deus quis fazer conhecer, pelo dom da fé, as riquezas deste mistério entre os povos, o qual é Cristo, de nenhum modo poderia o homem chegar ao conhecimento de tal sabedoria\".",
        "editora": "Permanência",
        "numeroPaginas": 230,
        "paisOrigem": "Brasil",
        "titulo": "Catecismo Maior de São Pio X",
        "status": 3,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/catecismo_maior_de_sao_pio_x?alt=media&token=2acd9534-7cff-4166-85b0-70af7441ed94",
        "subtitulo": "Catecismo",
        "categoria": "Religioso",
        "dataHoraCriacao": 1601050089172,
        "dataHoraAlteracao": 1601050089172,
        "id": 98
    },
    {
        "firebaseCodigo": "yj2vMbJZMjSdd1xUnWaB",
        "anoEdicao": "2014",
        "autor": "Padre Reginaldo Manzotti",
        "descricao": "Este é o novo livro do Padre Reginaldo Manzotti. Milagres apresenta uma seleção cuidadosa feita diretamente pelo padre a partir das Sagradas Escrituras: são sete milagres de Jesus que podem mudar nossas vidas. Como? Conhecendo, compreendendo e agindo. Na correria do dia a dia, estamos desatentos aos sinais enviados pelo Criador. Eles existem, com certeza, embora nem sempre sejam tão palpáveis quando os milagres realizados por Jesus. Porém, são sinais igualmente transformadores. O primeiro passo para adotarmos uma nova atitude é doutrinar o olhar para aprender a enxergar as manifestações divinas. Eis a missão desta que é a primeira obra da trilogia Sinais do Sagrado. Mais do que folhear as páginas para obter informações, o que o autor propõe a você é uma consulta atenta e sem pressa. Não no tempo dos ponteiros do relógio, mas no da alma sedenta por sabedoria. Faça deste livro um momento de encontro com Deus e com a sua própria essência renovada por meio da Palavra divina. Se preferir, você pode ler um trecho a cada dia. Sozinho ou em grupo. Trata- se de uma proposta de leitura que alimenta a fé e fortalece a união com Deus.",
        "editora": "Agir",
        "numeroPaginas": 143,
        "paisOrigem": "Brasil",
        "titulo": "Milagres",
        "status": 3,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/milagres?alt=media&token=92b311cd-c150-448a-adcb-65099f642c5e",
        "subtitulo": "Sinais do Sagrado",
        "categoria": "Católico",
        "dataHoraCriacao": 1601050089173,
        "dataHoraAlteracao": 1601050089173,
        "id": 99
    },
    {
        "firebaseCodigo": "z1IsqiKzGoAGZt58gyAY",
        "anoEdicao": "2007",
        "autor": "William. P. Young",
        "descricao": "Mack recebe uma mensagem e retorna a Cabana..",
        "editora": "Porto Editora",
        "numeroPaginas": 272,
        "paisOrigem": "Brasil",
        "titulo": "De Volta A Cabana",
        "status": 2,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 0,
        "dataCompra": "2019",
        "preco": "0,00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/de_volta_a_cabana?alt=media&token=896f1224-c2d3-44eb-9551-035c12fbba88",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089173,
        "dataHoraAlteracao": 1601050089173,
        "id": 100
    },
    {
        "firebaseCodigo": "zayNZp4bAg0rDdo9fBsd",
        "anoEdicao": "2019",
        "autor": "Nicholas Sparks",
        "descricao": "Fãs de Diário de uma paixão, Uma carta de amor e outros sucessos do autor vão devorar este livro\".          \n                    Entertainment Weekly.\n\nUma das lembranças mais felizes de Ronnie era se sentar ao lado do pai ao piano e tocar por horas. Porém, desde que ele se separou da mãe dela e se mudou de Nova York, a menina só consegue olhar para o instrumento com raiva e mágoa. Três anos após o divórcio, Ronnie mal tem contato com ele e a mãe acha que já está na hora de os dois reconstruírem os laços, passando juntos as férias de verão. Antes um pianista que sempre estava viajando, o pai agora leva uma vida tranquila numa pequena cidade litorânea, imerso no trabalho de reconstrução do vitral de uma igreja, destruído em um incêndio misterioso. A Última coisa que a rebelde Ronnie que é passar meses num local entediante como aquele, mais aos poucos a brisa da praia e de novas paixões começa a acalentar seu coração ressentido. Um dos maiores sucessos de Nicholas Sparks, a última música é uma verdadeira celebração de todos os tipos de amor, desde a paixão do primeiro romance e a afeição entre pais e filhos até a devoção à música.\n\n",
        "editora": "Arqueiro",
        "numeroPaginas": 366,
        "paisOrigem": "Brasil",
        "titulo": "A Última Música",
        "status": 3,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/a_ultima_musica?alt=media&token=f28fa405-9ba8-49e2-8af9-3da1b7081a9e",
        "subtitulo": "",
        "categoria": "",
        "dataHoraCriacao": 1601050089173,
        "dataHoraAlteracao": 1601050089173,
        "id": 101
    },
    {
        "firebaseCodigo": "zfnFiL7kNjT47PsuXzTU",
        "anoEdicao": "2014",
        "autor": "Padre João Clã Dias ",
        "descricao": "Oração ào Santíssimo Sacramento, e depois da Comunhão.",
        "editora": "Araustos do Evangelho",
        "numeroPaginas": 30,
        "paisOrigem": "Brasil",
        "titulo": "Adoremos ao Senhor ",
        "status": 3,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/adoremos_ao_senhor_?alt=media&token=4fc74945-11a1-404f-87ac-5d60960a7317",
        "subtitulo": "Oração Eucarística",
        "categoria": "Católico",
        "dataHoraCriacao": 1601050089174,
        "dataHoraAlteracao": 1601050089174,
        "id": 108
    },
    {
        "firebaseCodigo": "zhMZbrjQGuXb5ePlIfBP",
        "anoEdicao": "2012",
        "autor": "Ivan Panazzolo Júnior",
        "descricao": "Para sempre é uma história verdadeira sobre a reconstrução de um casamento depois de um evento traumático que poderia ter feito a maioria das outras pessoas desistir, mas que para eles foi a chance de um novo começo.",
        "editora": "Novo Conceito",
        "numeroPaginas": 127,
        "paisOrigem": "Brasil",
        "titulo": "Para Sempre",
        "status": 2,
        "isbn10": "0",
        "isbn13": "0",
        "numeroEdicao": 1,
        "dataCompra": "2019",
        "preco": "0.00",
        "url": "https://firebasestorage.googleapis.com/v0/b/livros-19696.appspot.com/o/para_sempre?alt=media&token=13bb0ee3-e1db-40a2-94aa-1d823aa780d0",
        "subtitulo": "A História que inspirou o filme",
        "categoria": "Romance",
        "dataHoraCriacao": 1601050089174,
        "dataHoraAlteracao": 1601050089174,
        "id": 102
    }
]